{
  "milestone": "1.2",
  "title": "Package Management",
  "description": "CIS Ubuntu Linux 24.04 LTS Benchmark - Section 1.2: Package Management",
  "version": "1.0.0",
  "controls": [
    {
      "id": "1.2.1.1",
      "title": "Ensure GPG keys are configured",
      "section": "1.2.1 Configure Package Repositories",
      "profile": "Level1",
      "automated": false,
      "type": "Manual",
      "expected": "GPG keys properly configured for package repositories",
      "cis_reference": "https://www.cisecurity.org/benchmark/ubuntu_linux",
      "cis_control_id": "1.2.1.1",
      "description": "The /tmp directory is a world -writable directory used for temporary storage by all users and some applications.\n- IF - an entry for /tmp exists in /etc/fstab it will take precedence over entries in systemd default unit file.\nNote: In an environment where the main system is diskless and connected to iSCSI, entries in /etc/fstab may not take precedence.\n/tmp can be configured to use tmpfs .\ntmpfs puts everything into the kernel internal caches and grows and shrinks to accommodate the files it contains and is able to swap unneeded pages out to swap space. It has maximum size limits which can be adjusted on the fly via mount -o remount .\nSince tmpfs lives completely in the page cache and on swap, all tmpfs pages will be shown as \"Shmem\" in /proc/meminfo and \"Shared\" in free . Notice that these counters also include shared memory. The most reliable way to get the count is using df and du.\ntmpfs has three mount options for sizing:\n• size : The limit of allocated bytes for this tmpfs instance. The default is half of your physical RAM without swap. If you oversize your tmpfs instances the machine will deadlock since the OOM handler will not be able to free that memory.\n• nr_blocks : The same as size, but in blocks of PAGE_SIZE.\n• nr_inodes : The maximum number of inodes for this instance. The default is half of the number of your physical RAM pages, or (on a machine with highmem) the number of lowmem RAM pages, whichever is the lower.\nThese parameters accept a suffix k, m or g and can be changed on remount. The size parameter also accepts a suffix % to limit this tmpfs instance to that percentage of your physical RAM. The default, when neither size nor nr_blocks is specified, is size=50% .\n",
      "remediation": "First ensure that systemd is correctly configured to ensure that /tmp will be mounted at boot time.\n# systemctl unmask tmp.mount For specific configuration requirements of the /tmp mount for your environment, modify /etc/fstab .\nExample of using tmpfs with specific mount options:\ntmpfs /tmp tmpfs defaults,rw,nosuid,nodev,noexec,relatime,size=2G 0 0 Note: the size=2G is an example of setting a specific size for tmpfs .\nExample of using a volume or disk with specific mount options. The source location of the volume or disk will vary depending on your environment:\n<device> /tmp <fstype> defaults,nodev,nosuid,noexec 0 0"
    },
    {
      "id": "1.2.1.2",
      "title": "Ensure package manager repositories are configured",
      "section": "1.2.1 Configure Package Repositories",
      "profile": "Level1",
      "automated": false,
      "type": "Manual",
      "expected": "Package repositories properly configured",
      "cis_reference": "https://www.cisecurity.org/benchmark/ubuntu_linux",
      "cis_control_id": "1.2.1.2",
      "description": "The nodev mount option specifies that the filesystem cannot contain special devices.",
      "remediation": "- IF - a separate partition exists for /tmp .\nEdit the /etc/fstab file and add nodev to the fourth field (mounting options) for the /tmp partition.\nExample:\n<device> /tmp <fstype> defaults,rw,nosuid,nodev,noexec,relatime 0 0\nRun the following command to remount /tmp with the configured options:\n# mount -o remount /tmp"
    },
    {
      "id": "1.2.2.1",
      "title": "Ensure updates, patches, and additional security software are installed",
      "section": "1.2.2 Configure Package Updates",
      "profile": "Level1",
      "automated": false,
      "type": "Manual",
      "expected": "System packages are up to date",
      "cis_reference": "https://www.cisecurity.org/benchmark/ubuntu_linux",
      "cis_control_id": "1.2.2.1",
      "description": "The /dev/shm directory is a world -writable directory that can function as shared memory that facilitates inter process communication (IPC).",
      "remediation": "For specific configuration requirements of the /dev/shm mount for your environment,\nmodify /etc/fstab .\nExample:\ntmpfs /dev/shm tmpfs defaults,rw,nosuid,nodev,noexec,relatime,size=2G 0 0"
    }
  ]
}