{
  "milestone": "2.1",
  "title": "Configure Server Services",
  "description": "CIS Ubuntu Linux 24.04 LTS Benchmark - Section 2.1: Configure Server Services",
  "version": "1.0.0",
  "controls": [
    {
      "id": "2.1.1",
      "title": "Ensure autofs services are not in use",
      "section": "2.1 Configure Server Services",
      "description": "autofs allows automatic mounting of devices, typically including CD/DVDs and USB drives.",
      "impact": "With autofs enabled anyone with physical access could attach a USB drive or disc and have its contents available in system even if they lacked permissions to mount it themselves.",
      "remediation": "Run the following commands to remove autofs: systemctl --now disable autofs && apt purge autofs",
      "profile": "Level1",
      "automated": true,
      "type": "ServiceNotInUse",
      "service_names": ["autofs"],
      "package_names": ["autofs"]
    },
    {
      "id": "2.1.2",
      "title": "Ensure avahi daemon services are not in use",
      "section": "2.1 Configure Server Services",
      "description": "Avahi is a free zeroconf implementation, including a system for multicast DNS/DNS-SD service discovery.",
      "impact": "Automatic discovery of network services is not normally required for system functionality. It is recommended to remove this package to reduce the potential attack surface.",
      "remediation": "Run the following commands to remove avahi: systemctl --now disable avahi-daemon && apt purge avahi-daemon",
      "profile": "Level1",
      "automated": true,
      "type": "ServiceNotInUse",
      "service_names": ["avahi-daemon"],
      "package_names": ["avahi-daemon"]
    },
    {
      "id": "2.1.3",
      "title": "Ensure dhcp server services are not in use",
      "section": "2.1 Configure Server Services",
      "description": "The Dynamic Host Configuration Protocol (DHCP) is a service that allows machines to be dynamically assigned IP addresses.",
      "impact": "Unless a system is specifically set up to act as a DHCP server, it is recommended that this package be removed to reduce the potential attack surface.",
      "remediation": "Run the following commands to remove dhcp server: systemctl --now disable isc-dhcp-server && apt purge isc-dhcp-server",
      "profile": "Level1",
      "automated": true,
      "type": "ServiceNotInUse",
      "service_names": ["isc-dhcp-server", "isc-dhcp-server6"],
      "package_names": ["isc-dhcp-server"]
    },
    {
      "id": "2.1.4",
      "title": "Ensure dns server services are not in use",
      "section": "2.1 Configure Server Services",
      "description": "The Domain Name System (DNS) is a hierarchical naming system that maps names to IP addresses for computers, services and other resources connected to a network.",
      "impact": "Unless a system is specifically designated to act as a DNS server, it is recommended that the package be removed to reduce the potential attack surface.",
      "remediation": "Run the following commands to remove dns server: systemctl --now disable bind9 && apt purge bind9",
      "profile": "Level1",
      "automated": true,
      "type": "ServiceNotInUse",
      "service_names": ["bind9", "named"],
      "package_names": ["bind9"]
    },
    {
      "id": "2.1.5",
      "title": "Ensure dnsmasq services are not in use",
      "section": "2.1 Configure Server Services",
      "description": "dnsmasq is a lightweight tool that provides network infrastructure for small networks: DNS, DHCP, router advertisement and network boot.",
      "impact": "Unless a system is specifically designated to act as a DNS forwarder, it is recommended that the package be removed to reduce the potential attack surface.",
      "remediation": "Run the following commands to remove dnsmasq: systemctl --now disable dnsmasq && apt purge dnsmasq",
      "profile": "Level1",
      "automated": true,
      "type": "ServiceNotInUse",
      "service_names": ["dnsmasq"],
      "package_names": ["dnsmasq"]
    },
    {
      "id": "2.1.6",
      "title": "Ensure ftp server services are not in use",
      "section": "2.1 Configure Server Services",
      "description": "The File Transfer Protocol (FTP) provides networked computers with the ability to transfer files.",
      "impact": "FTP does not protect the confidentiality of data or authentication credentials. It is recommended sftp be used if file transfer is required.",
      "remediation": "Run the following commands to remove ftp server: systemctl --now disable vsftpd && apt purge vsftpd",
      "profile": "Level1",
      "automated": true,
      "type": "ServiceNotInUse",
      "service_names": ["vsftpd", "proftpd"],
      "package_names": ["vsftpd", "proftpd-basic"]
    },
    {
      "id": "2.1.7",
      "title": "Ensure ldap server services are not in use",
      "section": "2.1 Configure Server Services",
      "description": "The Lightweight Directory Access Protocol (LDAP) was introduced as a replacement for NIS/YP.",
      "impact": "If the system will not need to act as an LDAP server, it is recommended that the software be removed to reduce the potential attack surface.",
      "remediation": "Run the following commands to remove ldap server: systemctl --now disable slapd && apt purge slapd",
      "profile": "Level1",
      "automated": true,
      "type": "ServiceNotInUse",
      "service_names": ["slapd"],
      "package_names": ["slapd"]
    },
    {
      "id": "2.1.8",
      "title": "Ensure message access server services are not in use",
      "section": "2.1 Configure Server Services",
      "description": "dovecot and cyrus-imap are software packages that can be used to provide IMAP or POP3 services.",
      "impact": "Unless POP3 and/or IMAP servers are to be provided by this system, it is recommended that the package be removed to reduce the potential attack surface.",
      "remediation": "Run the following commands to remove message access servers: systemctl --now disable dovecot && apt purge dovecot-imapd dovecot-pop3d cyrus-imap",
      "profile": "Level1",
      "automated": true,
      "type": "ServiceNotInUse",
      "service_names": ["dovecot", "cyrus-imap"],
      "package_names": ["dovecot-imapd", "dovecot-pop3d", "cyrus-imap"]
    },
    {
      "id": "2.1.9",
      "title": "Ensure network file system services are not in use",
      "section": "2.1 Configure Server Services",
      "description": "The Network File System (NFS) is one of the first and most widely distributed file systems in the UNIX environment.",
      "impact": "If the system does not export NFS shares or act as an NFS client, it is recommended that these services be removed to reduce remote attack surface.",
      "remediation": "Run the following commands to remove nfs: systemctl --now disable nfs-server && apt purge nfs-kernel-server",
      "profile": "Level1",
      "automated": true,
      "type": "ServiceNotInUse",
      "service_names": ["nfs-server", "nfs-kernel-server"],
      "package_names": ["nfs-kernel-server"]
    },
    {
      "id": "2.1.10",
      "title": "Ensure nis server services are not in use",
      "section": "2.1 Configure Server Services",
      "description": "The Network Information Service (NIS) (formally known as Yellow Pages) is a client-server directory service protocol for distributing system configuration files.",
      "impact": "The NIS service is inherently an insecure system that has been vulnerable to DOS attacks, buffer overflows and has poor authentication for querying NIS maps.",
      "remediation": "Run the following commands to remove nis: systemctl --now disable nis && apt purge nis",
      "profile": "Level1",
      "automated": true,
      "type": "ServiceNotInUse",
      "service_names": ["nis"],
      "package_names": ["nis"]
    },
    {
      "id": "2.1.11",
      "title": "Ensure print server services are not in use",
      "section": "2.1 Configure Server Services",
      "description": "The Common UNIX Print System (CUPS) provides the ability to print to both local and network printers.",
      "impact": "If the system does not need to print jobs or accept print jobs from other systems, it is recommended that CUPS be removed to reduce the potential attack surface.",
      "remediation": "Run the following commands to remove cups: systemctl --now disable cups && apt purge cups",
      "profile": "Level1",
      "automated": true,
      "type": "ServiceNotInUse",
      "service_names": ["cups"],
      "package_names": ["cups"]
    },
    {
      "id": "2.1.12",
      "title": "Ensure rpcbind services are not in use",
      "section": "2.1 Configure Server Services",
      "description": "The rpcbind service maps RPC services to the ports on which they listen.",
      "impact": "If the system does not require rpc based services, it is recommended that rpcbind be removed to reduce the remote attack surface of the system.",
      "remediation": "Run the following commands to remove rpcbind: systemctl --now disable rpcbind && apt purge rpcbind",
      "profile": "Level1",
      "automated": true,
      "type": "ServiceNotInUse",
      "service_names": ["rpcbind"],
      "package_names": ["rpcbind"]
    },
    {
      "id": "2.1.13",
      "title": "Ensure rsync services are not in use",
      "section": "2.1 Configure Server Services",
      "description": "The rsync service can be used to synchronize files between systems over network links.",
      "impact": "The rsync service presents a security risk as a communication mechanism that may not be required.",
      "remediation": "Run the following commands to remove rsync: systemctl --now disable rsync && apt purge rsync",
      "profile": "Level1",
      "automated": true,
      "type": "ServiceNotInUse",
      "service_names": ["rsync"],
      "package_names": ["rsync"]
    },
    {
      "id": "2.1.21",
      "title": "Ensure mail transfer agent is configured for local-only mode",
      "section": "2.1 Configure Server Services",
      "description": "Mail Transfer Agents (MTA), such as sendmail and Postfix, are used to listen for incoming mail and transfer the messages to the appropriate user or mail server.",
      "impact": "The software for all Mail Transfer Agents is complex and most have a long history of security issues. While it is important to ensure that the system can process local mail messages, it is not necessary to have the MTA's daemon listening on a port unless the server is intended to be a mail server that receives and processes mail from other systems.",
      "remediation": "Edit /etc/postfix/main.cf and add the following line to the RECEIVING MAIL section: inet_interfaces = loopback-only",
      "profile": "Level1",
      "automated": true,
      "type": "MTALocalOnly",
      "config_file": "/etc/postfix/main.cf",
      "expected_setting": "inet_interfaces = loopback-only"
    },
    {
      "id": "2.1.22",
      "title": "Ensure only approved services are listening on a network interface",
      "section": "2.1 Configure Server Services",
      "description": "Services that are listening for network connections increase that attack surface of the system.",
      "impact": "Services listening on the network increase the attack surface of a system.",
      "remediation": "For each port identified in the audit which should not have a service listening on it, determine what program is using the port and stop and disable the associated service.",
      "profile": "Level1",
      "automated": false,
      "type": "Manual",
      "expected": "Only approved services listening on network interfaces"
    }
  ]
}