{
  "milestone": "1.6",
  "version": "1.0.0",
  "description": "CentOS Linux 7 CIS Benchmark v3.1.2 - Section 1.6",
  "controls": [
    {
      "id": "1.6.1.1",
      "title": "Ensure SELinux is installed",
      "section": "Section 1.6",
      "profile": "Level1",
      "automated": true,
      "type": "PackageInstalled",
      "severity": "medium",
      "cis_reference": "CIS CentOS Linux 7 Benchmark v3.1.2 - 1.6.1.1",
      "description": "SELinux provides Mandatory Access Control.",
      "rationale": "Without a Mandatory Access Control system installed only the default Discretionary Acces s Control system will be available.",
      "remediation": ": Run the following command to install SELinux: # yum install libselinux 109 | P a g e CIS Controls: Controls Version Control IG 1 IG 2 IG 3 v8 3.3 Configure Data Access Control Lists Configure data access control lists based on a user’s need to know. Apply data access control lists, also known as access permissions, to local and remote file systems, databases, and applications. ● ● ● v7 14.6 Protect Information through Access Control Lists Protect all information stored on systems with file system, network share, claims, application, or database specific access control lists. These controls will enforce the principle that only authorized individuals should have access to the information based on their need to access the information as a part of their responsibilities. ● ● ● 110 | P a g e",
      "impact": "None",
      "audit_command": "Verify SELinux is installed. Run the following command: # rpm -q libselinux libselinux -<version>",
      "package_name": "selinux",
      "expected_status": "installed"
    },
    {
      "id": "1.6.1.2",
      "title": "Ensure SELinux is not disabled in bootloader configuration",
      "section": "Section 1.6",
      "profile": "Level1",
      "automated": true,
      "type": "Manual",
      "severity": "medium",
      "cis_reference": "CIS CentOS Linux 7 Benchmark v3.1.2 - 1.6.1.2",
      "description": "Ensure SELinux is not disabled in bootloader configuration",
      "rationale": "Refer to CIS Benchmark documentation",
      "remediation": "Refer to CIS Benchmark documentation",
      "impact": "None",
      "audit_command": "Manual review required"
    },
    {
      "id": "1.6.1.3",
      "title": "Ensure SELinux policy is configured",
      "section": "Section 1.6",
      "profile": "Level1",
      "automated": true,
      "type": "FilePermissions",
      "severity": "medium",
      "cis_reference": "CIS CentOS Linux 7 Benchmark v3.1.2 - 1.6.1.3",
      "description": "Configure SELinux to meet or exceed the default targeted policy, which constrains daemons and system software only. Note: If your organization requires stricter policies, ensure that they are set in the /etc/selinux/config file.",
      "rationale": "Security configuration requirements vary from site to site. Some sites may mandat e a policy that is stricter than the default policy, which is perfectly acceptable. This item is intended to ensure that at least the default recommendations are met.",
      "remediation": ": Edit the /etc/selinux/config file to set the SELINUXTYPE parameter: SELINUXTYPE=targeted 113 | P a g e CIS Controls: Controls Version Control IG 1 IG 2 IG 3 v8 3.3 Configure Data Access Control Lists Configure data access control lists based on a user’s need to know. Apply data access control lists, also known as access permissions, to local and remote file systems, databases, and applications. ● ● ● v7 14.6 Protect Information through Access Control Lists Protect all information stored on systems with file system, network share, claims, application, or database specific access control lists. These controls will enforce the principle that only authorized individuals should have access to the information based on their need to access the information as a part of their responsibilities. ● ● ● 114 | P a g e",
      "impact": "None",
      "audit_command": "Run the following commands and ensure output matches either \" targeted \" or \" mls \": # grep SELINUXTYPE= /etc/selinux/config SELINUXTYPE=targeted # sestatus | grep 'Loaded policy' Loaded policy name: targeted",
      "file_path": "/etc/selinux/config"
    },
    {
      "id": "1.6.1.4",
      "title": "Ensure the SELinux mode is enforcing or permissive (Automa ted)",
      "section": "Section 1.6",
      "profile": "Level1",
      "automated": false,
      "type": "FileContent",
      "severity": "medium",
      "cis_reference": "CIS CentOS Linux 7 Benchmark v3.1.2 - 1.6.1.4",
      "description": "SELinux can run in one of three modes: disabled, permissive, or enforcing:  Enforcing - Is the default, and recommended, mode of operation; in enforcing mode SELinux operates normally, enforcing the loaded security policy on the entire system.  Permissive - The system acts as if SELinux is enforcing the loaded security policy, including labeling objects and emitting access denial entries in the logs, but it does not act ually deny any operations. While not recommended for production systems, permissive mode can be helpful for SELinux policy development.  Disabled - Is strongly discouraged; not only does the system avoid enforcing the SELinux policy, it also avoids labeling any persistent objects such as files, making it difficult to enable SELinux in the future Note: you can set individual domains to permissive mode while the system runs in enforcing mode. For example, to make the httpd_t domain permissive: # semanage permi ssive -a httpd_t",
      "rationale": "Running SELinux in disabled mode is strongly discouraged; not only does the system avoid enforcing the SELinux policy, it also avoids labeling any persistent objects such as files, making it difficult to enable SELinux in the fu ture. 115 | P a g e",
      "remediation": "Run one of the following commands to set SELinux's running mode: To set SELinux mode to Enforcing : # setenforce 1 OR To set SELinux mode to Permissive : # setenforce 0 Edit the /etc/selinux/config file to set the SELINUX parameter: For Enforcing mode: SELINUX=enforcing OR For Permissive mode: SELINUX=permissive",
      "impact": "None",
      "audit_command": "Run the following commands and ensure output matches: Run the following command to verify SELinux's current mode: # getenforce Enforcing -OR- Permissive Run the following command to verify SELinux's configured mode: # grep -Ei '^\\s*SELINUX= (enforcing|permissive)' /etc/selinux/config SELINUX=enforcing -OR- SELINUX=permissive"
    },
    {
      "id": "1.6.1.6",
      "title": "Ensure no unconfined services exist",
      "section": "Section 1.6",
      "profile": "Level1",
      "automated": true,
      "type": "FileContent",
      "severity": "medium",
      "cis_reference": "CIS CentOS Linux 7 Benchmark v3.1.2 - 1.6.1.6",
      "description": "Unconfined processes run in unconfined domains Note: Occasionally certain daemons such as backup or centralized management software may require running unconfined. Any such software should be carefully analyzed and documented before such an exception is made.",
      "rationale": "For unconfined processes, SELinux policy rules are applied, but policy rules exist that allow processes running in unconfined domains almost all access. Processes running in unconfined domains fall back to using DAC rules exclusively. If an unconfined process is compromised, SELinux does not prevent an attacker fr om gaining access to system resources and data, but of course, DAC rules are still used. SELinux is a security enhancement on top of DAC rules – it does not replace them",
      "remediation": ": Investigate any unconfined processes found during the audit action. They may need to have an existing security context assigned to them or a policy built for them. 120 | P a g e CIS Controls: Controls Version Control IG 1 IG 2 IG 3 v8 3.3 Configure Data Access Control Lists Configure data access control lists based on a user’s need to know. Apply data access control lists, also known as access permissions, to local and remote file systems, databases, and applications. ● ● ● v7 9.2 Ensure Only Approved Ports, Protocols and Services Are Running Ensure that only network ports, protocols, and services listening on a system with validated business needs, are running on each system. ● ● 121 | P a g e",
      "impact": "None",
      "audit_command": "Run the following command and verify not output is produced: # ps -eZ | grep un confined_service_t"
    },
    {
      "id": "1.6.1.7",
      "title": "Ensure SETroubleshoot is not installed ( Automated)",
      "section": "Section 1.6",
      "profile": "Level1",
      "automated": true,
      "type": "PackageInstalled",
      "severity": "medium",
      "cis_reference": "CIS CentOS Linux 7 Benchmark v3.1.2 - 1.6.1.7",
      "description": "The SETroubleshoot service notifies desktop users of SELinux denials through a user - friendly interface. The service provides important information around configuration errors, unauthorized intrusions, and other potential errors.",
      "rationale": "The SETroubleshoot service is an unnecessary daemon to have running on a server, especially if X Windows is disabled.",
      "remediation": ": Run the following command to Uninstall setroubleshoot : # yum remove setroubleshoot 122 | P a g e CIS Controls: Controls Version Control IG 1 IG 2 IG 3 v8 4.8 Uninstall or Disable Unnecessary Services on Enterprise Assets and Software Uninstall or disable unnecessary services on enterprise assets and software, such as an unused file sharing service, web application module, or service function. ● ● v7 14.6 Protect Information through Access Control Lists Protect all information stored on systems with file system, network share, claims, application, or database specific access control lists. These controls will enforce the principle that only authorized individuals should have access to the i nformation based on their need to access the information as a part of their responsibilities. ● ● ● 123 | P a g e",
      "impact": "None",
      "audit_command": "Verify setroubleshoot is not installed. Run the following command: # rpm -q setroubleshoot package setroubleshoot is not installed",
      "package_name": "setroubleshoot",
      "expected_status": "not_installed"
    },
    {
      "id": "1.6.1.8",
      "title": "Ensure the MCS Translation Service (mcstrans) is not installed",
      "section": "Section 1.6",
      "profile": "Level1",
      "automated": true,
      "type": "PackageInstalled",
      "severity": "medium",
      "cis_reference": "CIS CentOS Linux 7 Benchmark v3.1.2 - 1.6.1.8",
      "description": "Ensure the MCS Translation Service (mcstrans) is not installed",
      "rationale": "Refer to CIS Benchmark documentation",
      "remediation": "Refer to CIS Benchmark documentation",
      "impact": "None",
      "audit_command": "Manual review required",
      "expected_status": "not_installed"
    }
  ]
}