{
  "milestone": "2.3",
  "version": "1.0.0",
  "description": "CentOS Linux 7 CIS Benchmark v3.1.2 - Section 2.3",
  "controls": [
    {
      "id": "2.3.1",
      "title": "Ensure NIS Client is not installed",
      "section": "Section 2.3",
      "profile": "Level1",
      "automated": true,
      "type": "PackageInstalled",
      "severity": "medium",
      "cis_reference": "CIS CentOS Linux 7 Benchmark v3.1.2 - 2.3.1",
      "description": "The Network Information Service (NIS), formerly known as Yellow Pages, is a client -server directory service protocol used to distribute system configuration files. The NIS client ( ypbind ) was used to bind a machine to an NIS server and receive the distri buted configuration files.",
      "rationale": "The NIS service is inherently an insecure system that has been vulnerable to DOS attacks, buffer overflows and has poor authentication for querying NIS maps. NIS generally has been replaced by such protocols as Lightwe ight Directory Access Protocol (LDAP). It is recommended that the service be removed. Impact: Many insecure service clients are used as troubleshooting tools and in testing environments. Uninstalling them can inhibit capability to test and troubleshoot. If they are required it is advisable to remove the clients after use to prevent accidental or intentional misuse.",
      "remediation": "Refer to CIS Benchmark documentation",
      "impact": "None",
      "audit_command": ": Run the following command to verify that the ypbind package is not installed: # rpm -q ypbind package ypbind is not installed Remediatio n: Run the following command to remove the ypbind package: # yum remove ypbind 201 | P a g e CIS Controls: Controls Version Control IG 1 IG 2 IG 3 v8 4.8 Uninstall or Disable Unnecessary Services on Enterprise Assets and Software Uninstall or disable unnecessary services on enterprise assets and software, such as an unused file sharing service, web application module, or service function. ● ● v7 2.6 Address unapproved software Ensure that unauthorized software is either removed or the inventory is updated in a timely manner ● ● ● 202 | P a g e",
      "expected_status": "installed"
    },
    {
      "id": "2.3.2",
      "title": "Ensure rsh client is not installed",
      "section": "Section 2.3",
      "profile": "Level1",
      "automated": true,
      "type": "PackageInstalled",
      "severity": "medium",
      "cis_reference": "CIS CentOS Linux 7 Benchmark v3.1.2 - 2.3.2",
      "description": "The rsh package contains the client commands for the rsh services.",
      "rationale": "These legacy clients contain numerous security exposures and have been replaced with the more secure SSH package. Even if the server is removed, it is best to ensure the clients are also removed to prevent users from inadvertently attempting to use these c ommands and therefore exposing their credentials. Note that removing the rsh package removes the clients for rsh , rcp and rlogin . Impact: Many insecure service clients are used as troubleshooting tools and in testing environments. Uninstalling them can inhibit capability to test and troubleshoot. If they are required it is advisable to remove the clients after use to prevent accidental or intentional misuse.",
      "remediation": ": Run the following command to remove the rsh package: # yum remove rsh 203 | P a g e CIS Controls: Controls Version Control IG 1 IG 2 IG 3 v8 4.8 Uninstall or Disable Unnecessary Services on Enterprise Assets and Software Uninstall or disable unnecessary services on enterprise assets and software, such as an unused file sharing service, web application module, or service function. ● ● v7 2.6 Address unapproved software Ensure that unauthorized software is either removed or the inventory is updated in a timely manner ● ● ● 204 | P a g e",
      "impact": "None",
      "audit_command": "Run the following command to verify that the rsh package is not installed: # rpm -q rsh package rsh is not installed",
      "expected_status": "installed"
    },
    {
      "id": "2.3.3",
      "title": "Ensure talk client is not installed",
      "section": "Section 2.3",
      "profile": "Level1",
      "automated": true,
      "type": "PackageInstalled",
      "severity": "medium",
      "cis_reference": "CIS CentOS Linux 7 Benchmark v3.1.2 - 2.3.3",
      "description": "The talk software makes it possible for users to send and receive messages across systems through a terminal session. The talk client, which allows initialization of talk sessions, is installed by default.",
      "rationale": "The software presents a security risk as it use s unencrypted protocols for communication. Impact: Many insecure service clients are used as troubleshooting tools and in testing environments. Uninstalling them can inhibit capability to test and troubleshoot. If they are required it is advisable to remov e the clients after use to prevent accidental or intentional misuse.",
      "remediation": ": Run the following command to remove the talk package: # yum remove talk 205 | P a g e CIS Controls: Controls Version Control IG 1 IG 2 IG 3 v8 4.8 Uninstall or Disable Unnecessary Services on Enterprise Assets and Software Uninstall or disable unnecessary services on enterprise assets and software, such as an unused file sharing service, web application module, or service function. ● ● v7 2.6 Address unapproved software Ensure that unauthorized software is either removed or the inventory is updated in a timely manner ● ● ● 206 | P a g e",
      "impact": "None",
      "audit_command": "Run the following command to verify that the talk package is not installed: # rpm -q talk package talk is not installed",
      "expected_status": "installed"
    },
    {
      "id": "2.3.4",
      "title": "Ensure telnet client is not installed",
      "section": "Section 2.3",
      "profile": "Level1",
      "automated": true,
      "type": "PackageInstalled",
      "severity": "medium",
      "cis_reference": "CIS CentOS Linux 7 Benchmark v3.1.2 - 2.3.4",
      "description": "The telnet package contains the telnet client, which allows users to start connections to other systems via the telnet protocol.",
      "rationale": "The telnet protocol is insecure and unencrypted. The use of an unencrypted transmission medium could allow an unauthorized user to steal credentials. The ssh package provides an encrypted session and stronger security and is included in most Linux distributions. Imp act: Many insecure service clients are used as troubleshooting tools and in testing environments. Uninstalling them can inhibit capability to test and troubleshoot. If they are required it is advisable to remove the clients after use to prevent accidental or intentional misuse.",
      "remediation": ": Run the following command to remove the telnet package: # yum remove telnet 207 | P a g e CIS Controls: Controls Version Control IG 1 IG 2 IG 3 v8 4.8 Uninstall or Disable Unnecessary Services on Enterprise Assets and Software Uninstall or disable unnecessary services on enterprise assets and software, such as an unused file sharing service, web application module, or service function. ● ● v7 2.6 Address unapproved software Ensure that unauthorized software is either removed or the inventory is updated in a timely manner ● ● ● 208 | P a g e",
      "impact": "None",
      "audit_command": "Run the following command to verify that the telnet package is not installed: # rpm -q telnet package telnet is not installed",
      "expected_status": "installed"
    },
    {
      "id": "2.3.5",
      "title": "Ensure LDAP client is not installed",
      "section": "Section 2.3",
      "profile": "Level1",
      "automated": true,
      "type": "PackageInstalled",
      "severity": "medium",
      "cis_reference": "CIS CentOS Linux 7 Benchmark v3.1.2 - 2.3.5",
      "description": "Ensure LDAP client is not installed",
      "rationale": "Refer to CIS Benchmark documentation",
      "remediation": "Refer to CIS Benchmark documentation",
      "impact": "None",
      "audit_command": "Manual review required",
      "expected_status": "installed"
    }
  ]
}