{
  "milestone": "1.7",
  "version": "1.0.0",
  "description": "CentOS Linux 7 CIS Benchmark v3.1.2 - Section 1.7",
  "controls": [
    {
      "id": "1.7.1",
      "title": "Ensure message of the day is configured properly",
      "section": "Section 1.7",
      "profile": "Level1",
      "automated": true,
      "type": "FileContent",
      "severity": "medium",
      "cis_reference": "CIS CentOS Linux 7 Benchmark v3.1.2 - 1.7.1",
      "description": "The contents of the /etc/motd file are displayed to users after login and function as a message of the day for authenticated users. Unix -based systems have typically displayed information about the OS release and patch level upon logging in to the system. This information can be usefu l to developers who are developing software for a particular OS platform. If mingetty(8) supports the following options, they display operating system information: \\m - machine architecture \\r - operating system release \\s - operating system name \\v - operating system version",
      "rationale": "Warning messages inform users who are attempting to login to the system of their legal status regarding the system and must include the name of the organization that owns the system and any monitoring policies that ar e in place. Displaying OS and patch level information in login banners also has the side effect of providing detailed system information to attackers attempting to target specific exploits of a system. Authorized users can easily get this information by ru nning the \" uname -a \" command once they have logged in.",
      "remediation": ": Edit the /etc/motd file with the appropriate contents according to your site policy, remove any instances of \\m , \\r , \\s , \\v or references to the OS platform OR If the m otd is not used, this file can be removed. Run the following command to remove the motd file: # rm /etc/motd CIS Controls: Controls Version Control IG 1 IG 2 IG 3 v8 4.1 Establish and Maintain a Secure Configuration Process Establish and maintain a secure configuration process for enterprise assets (end - user devices, including portable and mobile, non -computing/IoT devices, and servers) and software (operating systems and applications). Review and update documentation annually, or when significant en terprise changes occur that could impact this Safeguard. ● ● ● v7 5.1 Establish Secure Configurations Maintain documented, standard security configuration standards for all authorized operating systems and software. ● ● ● 128 | P a g e",
      "impact": "None",
      "audit_command": "Run the following command and verify that the contents match site policy: # cat /etc/motd Run the following command and verify no results are returned: # grep -E -i \"(\\\\\\v|\\\\\\r|\\\\\\m|\\\\\\s|$(grep '^ID=' /etc/os -release | cut -d= - f2 | sed -e 's/\"//g'))\" /etc/motd 127 | P a g e",
      "file_path": "/etc/motd",
      "pattern": "-E"
    },
    {
      "id": "1.7.2",
      "title": "Ensure local login warning banner is configured properly",
      "section": "Section 1.7",
      "profile": "Level1",
      "automated": true,
      "type": "FileContent",
      "severity": "medium",
      "cis_reference": "CIS CentOS Linux 7 Benchmark v3.1.2 - 1.7.2",
      "description": "The contents of the /etc/issue file are displayed to users prior to login for local terminals. Unix -based systems have typically displayed information about the OS release and patch level upon logging in to the system. This information can be useful to developers who are developing software for a particular OS platform. If mingetty(8) supports the f ollowing options, they display operating system information: \\m - machine architecture \\r - operating system release \\s - operating system name \\v - operating system version - or the operating system's name",
      "rationale": "Warning messages inform users who are attempting to login to the system of their legal status regarding the system and must include the name of the organization that owns the system and any monitoring policies that are in place. Displaying OS and patch level information in login banners also h as the side effect of providing detailed system information to attackers attempting to target specific exploits of a system. Authorized users can easily get this information by running the \" uname -a \" command once they have logged in.",
      "remediation": ": Edit the /etc/issue file with the appropriate contents according to your site policy, remove any instances of \\m , \\r , \\s , \\v or references to the OS platform # echo \"Authorized uses only. All activity may be monitored and reported.\" > /etc/issue CIS Controls: Controls Version Control IG 1 IG 2 IG 3 v8 4.1 Establish and Maintain a Secure Configuration Process Establish and maintain a secure configuration process for enterprise assets (end - user devices, including portable and mobile, non-computing/IoT devices, and servers) and software (operating systems and applications). Review and update documentation annually, or when significant enterprise changes occur that could impact this Safeguard. ● ● ● v7 5.1 Establish Secure Configurations Maintain documented, standard security configuration standards for all authorized operating systems and software. ● ● ● 130 | P a g e",
      "impact": "None",
      "audit_command": "Run the follo wing command and verify that the contents match site policy: # cat /etc/issue Run the following command and verify no results are returned: # grep -E -i \"(\\\\\\v|\\\\\\r|\\\\\\m|\\\\\\s|$(grep '^ID=' /etc/os -release | cut -d= - f2 | sed -e 's/\"//g'))\" /etc/issue 129 | P a g e",
      "file_path": "/etc/issue",
      "pattern": "-E"
    },
    {
      "id": "1.7.3",
      "title": "Ensure remote login warning banner is configured properly",
      "section": "Section 1.7",
      "profile": "Level1",
      "automated": true,
      "type": "Manual",
      "severity": "medium",
      "cis_reference": "CIS CentOS Linux 7 Benchmark v3.1.2 - 1.7.3",
      "description": "Ensure remote login warning banner is configured properly",
      "rationale": "Refer to CIS Benchmark documentation",
      "remediation": "Refer to CIS Benchmark documentation",
      "impact": "None",
      "audit_command": "Manual review required"
    },
    {
      "id": "1.7.4",
      "title": "Ensure permissions on /etc/motd are configured",
      "section": "Section 1.7",
      "profile": "Level1",
      "automated": true,
      "type": "FilePermissions",
      "severity": "medium",
      "cis_reference": "CIS CentOS Linux 7 Benchmark v3.1.2 - 1.7.4",
      "description": "Ensure permissions on /etc/motd are configured",
      "rationale": "If the /etc/motd file does not have the correct ownership it could be modified by unauthorized users with incorrect or misleading information.",
      "remediation": ": Run the following commands to set permissions on /etc/motd : # chown root:root /etc/motd # chmod u -x,go-wx /etc/motd 133 | P a g e CIS Controls: Controls Version Control IG 1 IG 2 IG 3 v8 3.3 Configure Data Access Control Lists Configure data access control lists based on a user’s need to know. Apply data access control lists, also known as access permissions, to local and remote file systems, databases, and applications. ● ● ● v7 14.6 Protect Information through Access Control Lists Protect all information stored on systems with file system, network share, claims, application, or database specific access control lists. These controls will enforce the principle that only authorized indi viduals should have access to the information based on their need to access the information as a part of their responsibilities. ● ● ● 134 | P a g e",
      "impact": "None",
      "audit_command": "Run the following command and verify Uid and Gid are both 0/root and Access is 644 : # stat /etc/motd Access: (0644/ -rw-r--r--) Uid: ( 0/ root) Gid: ( 0/ root)",
      "file_path": "/etc/motd"
    },
    {
      "id": "1.7.5",
      "title": "Ensure permissions on /etc/issue are configured",
      "section": "Section 1.7",
      "profile": "Level1",
      "automated": true,
      "type": "FilePermissions",
      "severity": "medium",
      "cis_reference": "CIS CentOS Linux 7 Benchmark v3.1.2 - 1.7.5",
      "description": "The contents of the /etc/issue file are displayed to users prior to login for local terminals.",
      "rationale": "If the /etc/issue file does not have the correct ownership it could be modified by unauthorized users with incorrect or misleading information.",
      "remediation": ": Run the following commands to set permissions on /etc/issue : # chown root:root /etc/issue # chmod u -x,go-wx /etc/issue 135 | P a g e CIS Controls: Controls Version Control IG 1 IG 2 IG 3 v8 3.3 Configure Data Access Control Lists Configure data access control lists based on a user’s need to know. Apply data access control lists, also known as access permissions, to local and remote file systems, databases, and applications. ● ● ● v7 14.6 Protect Information through Access Control Lists Protect all information stored on systems with file system, network share, claims, application, or database specific access control lists. These controls will enforce the principle that only authorized indi viduals should have access to the information based on their need to access the information as a part of their responsibilities. ● ● ● 136 | P a g e",
      "impact": "None",
      "audit_command": "Run the following command and verify Uid and Gid are both 0/root and Access is 644 : # stat /etc/issue Access: (0644/ -rw-r--r--) Uid: ( 0/ root) Gid: ( 0/ root)",
      "file_path": "/etc/issue"
    },
    {
      "id": "1.7.6",
      "title": "Ensure permissions on /etc/issue.net are configured",
      "section": "Section 1.7",
      "profile": "Level1",
      "automated": true,
      "type": "Manual",
      "severity": "medium",
      "cis_reference": "CIS CentOS Linux 7 Benchmark v3.1.2 - 1.7.6",
      "description": "Ensure permissions on /etc/issue.net are configured",
      "rationale": "Refer to CIS Benchmark documentation",
      "remediation": "Refer to CIS Benchmark documentation",
      "impact": "None",
      "audit_command": "Manual review required"
    }
  ]
}