{
  "milestone": "2.2",
  "version": "1.0.0",
  "description": "CentOS Linux 7 CIS Benchmark v3.1.2 - Section 2.2",
  "controls": [
    {
      "id": "2.2.1.1",
      "title": "Ensure time sy nchronization is in use",
      "section": "Section 2.2",
      "profile": "Level1",
      "automated": false,
      "type": "Manual",
      "severity": "medium",
      "cis_reference": "CIS CentOS Linux 7 Benchmark v3.1.2 - 2.2.1.1",
      "description": "System time should be synchronized between all systems in an environment. This is typically done by establishing an authoritative time server or set of servers and having all systems synchronize their clocks to them. Note:  If another method for time synchronization is being used, this section may be skipped.  Only one time synchronization package should be installed",
      "rationale": "Time synchronizatio n is important to support time sensitive security mechanisms like Kerberos and also ensures log files have consistent time records across the enterprise, which aids in forensic investigations.",
      "remediation": ": Run One of the following commands to install chrony or NTP: To install chrony, run the following command: # yum install chrony OR To install ntp, run the following command: # yum install ntp Note: On systems where host based time synchronization is available consult your virtualization software documentation and setup host based synchronization. Additional Information:  On systems where host bas ed time synchronization is not available, verify that chrony or NTP is installed.  On systems where host based time synchronization is available consult your documentation and verify that host based synchronization is in use. CIS Controls: Controls Version Control IG 1 IG 2 IG 3 v8 8.4 Standardize Time Synchronization Standardize time synchronization. Configure at least two synchronized time sources across enterprise assets, where supported. ● ● v7 6.1 Utilize Three Synchronized Time Sources Use at least three synchronized time sources from which all servers and network devices retrieve time information on a regular basis so that timestamps in logs are consistent. ● ● 157 | P a g e",
      "impact": "None",
      "audit_command": "Run the following commands to verify that a time synchro nization packages is installed: # rpm -q chrony ntp chrony-<version> # rpm -q ntp ntp-<version> 156 | P a g e"
    },
    {
      "id": "2.2.1.2",
      "title": "Ensure chrony is configured",
      "section": "Section 2.2",
      "profile": "Level1",
      "automated": true,
      "type": "FileContent",
      "severity": "medium",
      "cis_reference": "CIS CentOS Linux 7 Benchmark v3.1.2 - 2.2.1.2",
      "description": "chrony is a daemon which implements the Network Time Protocol (NTP) and is designed to synchronize system clocks across a variety of systems and use a source that is highly accurate. More information on chrony can be found at http://chrony.tuxfamily.org/ . chrony can be configured to be a client and/or a server.",
      "rationale": "If chrony is in use on the system proper configuration is vital to ensuring time synchroni zation is working properly. Note: This recommendation only applies if chrony is in use on the system.",
      "remediation": ": Add or edit server or pool lines to /etc/chrony.conf as appropriate: server <remote -server> Add or edit the OPTIONS in /etc/sysconfig/chronyd to include ' -u chrony ': OPTIONS=\" -u chrony\" CIS Controls: Controls Version Control IG 1 IG 2 IG 3 v8 8.4 Standardize Time Synchronization Standardize time synchronization. Configure at least two synchronized time sources across enterprise assets, where supported. ● ● v7 6.1 Utilize Three Synchronized Time Sources Use at least three synchronized time sources from which all servers and network devices retrieve time information on a regular basis so that timestamps in logs are consistent. ● ● 159 | P a g e",
      "impact": "None",
      "audit_command": "IF chrony is installed on the system: Run the following command and verify remote server is configured properly: # grep -E \"^(server|pool)\" /etc/ch rony.conf server <remote -server> Multiple servers may be configured. Run the following command and verify OPTIONS includes ' -u chrony ': # grep ^OPTIONS /etc/sysconfig/chronyd OPTIONS=\" -u chrony\" Additional options may be present. 158 | P a g e"
    },
    {
      "id": "2.2.1.3",
      "title": "Ensure ntp is configured",
      "section": "Section 2.2",
      "profile": "Level1",
      "automated": true,
      "type": "FileContent",
      "severity": "medium",
      "cis_reference": "CIS CentOS Linux 7 Benchmark v3.1.2 - 2.2.1.3",
      "description": "ntp is a daemon which implements the Network Time Protocol (NTP). It is designed to synchronize system clocks across a variety of systems and use a source that is highly accurate. More information on NTP can be found at http://www.ntp.org . ntp can be configured to be a client and/or a server. Note: This recommendation only applies if ntp is in use on the system.",
      "rationale": "If ntp is in use on the system proper configuration is vital to en suring time synchronization is working properly. 160 | P a g e",
      "remediation": ": Add or edit restric t lines in /etc/ntp.conf to match the following: restrict -4 default kod nomodify notrap nopeer noquery restrict -6 default kod nomodify notrap nopeer noquery Add or edit server or pool lines to /etc/ntp.conf as appropriate: server <remote -server> Add or edit the OPTIONS in /etc/sysconfig/ntpd to include ' -u ntp:ntp ': OPTIONS=\" -u ntp:ntp\" Reload the systemd daemon: systemctl daemon -reload Enable and start the ntp service: systemctl --now enable ntpd CIS Controls: Controls Version Control IG 1 IG 2 IG 3 v8 8.4 Standardize Time Synchronization Standardize time synchronization. Configure at least two synchronized time sources across enterprise assets, where supported. ● ● v7 6.1 Utilize Three Synchronized Time Sources Use at least three synchronized time sources from which all servers and network devices retrieve time information on a regular basis so that timestamps in logs are consistent. ● ● 162 | P a g e",
      "impact": "None",
      "audit_command": "IF NTP is installed on the system: Run the following command and verify ntpd is enabled: # systemctl is -enabled ntpd enabled Run the following command and verify output matches: # grep \"^restrict\" /etc/ntp.conf restrict -4 default kod nomodify notrap nopeer noquery restrict -6 default kod nomodify notrap nopeer noquery The -4 in the first line is optional and options after default can appear in any order. Additional restriction lines may exist. Run the following command and verify remote server is configured properly: # grep -E \"^(server|pool)\" /etc/ntp.conf server <remote -server> Multiple servers may be configured Run the following commands and verify that ' -u ntp:ntp ' is included in OPTIONS OR ExecStart as listed: # grep \"^OPTIONS\" /etc/sysconfig/ntpd OPTIONS=\" -u ntp:ntp\" OR # grep \"^ExecStart\" /usr/lib/systemd/system/ntpd.service ExecStart=/usr/sbin/ntpd -u ntp:ntp $OPTIONS Additional options may be present. 161 | P a g e"
    },
    {
      "id": "2.2.1.4",
      "title": "Ensure chrony is configured\" needs to be updated",
      "section": "Section 2.2",
      "profile": "Level1",
      "automated": false,
      "type": "Manual",
      "severity": "medium",
      "cis_reference": "CIS CentOS Linux 7 Benchmark v3.1.2 - 2.2.1.4",
      "description": "Ensure chrony is configured\" needs to be updated",
      "rationale": "Refer to CIS Benchmark documentation",
      "remediation": "Refer to CIS Benchmark documentation",
      "impact": "None",
      "audit_command": "Manual review required"
    },
    {
      "id": "2.2.10",
      "title": "Ensure IMAP and POP3 server is not installed",
      "section": "Section 2.2",
      "profile": "Level1",
      "automated": true,
      "type": "PackageInstalled",
      "severity": "medium",
      "cis_reference": "CIS CentOS Linux 7 Benchmark v3.1.2 - 2.2.10",
      "description": "dovecot is an open source IMAP and POP3 server for Linux based systems.",
      "rationale": "Unless POP3 and/or IMAP servers are to be provided by this system, it is recommended that the package be removed to reduce the potential attack surface. Notes:  Several IMAP/POP3 servers exist and can use other service names. courier-imap and cyrus-imap are example services that provide a mail server.  These and other services should also be audited and the packages remo ved if not required.",
      "remediation": ": Run the following command to remove dovecot : # yum remove dovecot 179 | P a g e CIS Controls: Controls Version Control IG 1 IG 2 IG 3 v8 4.8 Uninstall or Disable Unnecessary Services on Enterprise Assets and Software Uninstall or disable unnecessary services on enterprise assets and software, such as an unused file sharing service, web application module, or service function. ● ● v7 9.2 Ensure Only Approved Ports, Protocols and Services Are Running Ensure that only network ports, protocols, and services listening on a system with validated business needs, are running on each system. ● ● 180 | P a g e",
      "impact": "None",
      "audit_command": "Run the following command to verify dovecot is not installed: # rpm -q dovecot package dovecot is not installed",
      "expected_status": "installed"
    },
    {
      "id": "2.2.11",
      "title": "Ensure Samba is not installed",
      "section": "Section 2.2",
      "profile": "Level1",
      "automated": true,
      "type": "PackageInstalled",
      "severity": "medium",
      "cis_reference": "CIS CentOS Linux 7 Benchmark v3.1.2 - 2.2.11",
      "description": "Ensure Samba is not installed",
      "rationale": "Refer to CIS Benchmark documentation",
      "remediation": "Refer to CIS Benchmark documentation",
      "impact": "None",
      "audit_command": "Manual review required",
      "expected_status": "installed"
    },
    {
      "id": "2.2.12",
      "title": "Ensure HTTP Proxy Server is not installed",
      "section": "Section 2.2",
      "profile": "Level1",
      "automated": true,
      "type": "PackageInstalled",
      "severity": "medium",
      "cis_reference": "CIS CentOS Linux 7 Benchmark v3.1.2 - 2.2.12",
      "description": "Squid is a standard proxy server used in many distributions and environments.",
      "rationale": "Unless a system is specifically set up to act as a proxy server, it is recommended that the squid package be removed to reduce the potential attack surface. Note: Several HTTP proxy servers exi st. These should be checked and removed unless required.",
      "remediation": ": Run the following command to remove the squid package: # yum remove squi d 183 | P a g e CIS Controls: Controls Version Control IG 1 IG 2 IG 3 v8 4.8 Uninstall or Disable Unnecessary Services on Enterprise Assets and Software Uninstall or disable unnecessary services on enterprise assets and software, such as an unused file sharing service, web application module, or service function. ● ● v7 9.2 Ensure Only Approved Ports, Protocols and Services Are Running Ensure that only network ports, protocols, and services listening on a system with validated business needs, are running on each system. ● ● 184 | P a g e",
      "impact": "None",
      "audit_command": "Run the following command to verify squid is not installed: # rpm -q squid package squid is not installed",
      "expected_status": "installed"
    },
    {
      "id": "2.2.13",
      "title": "Ensure net -snmp is not installed",
      "section": "Section 2.2",
      "profile": "Level1",
      "automated": true,
      "type": "PackageInstalled",
      "severity": "medium",
      "cis_reference": "CIS CentOS Linux 7 Benchmark v3.1.2 - 2.2.13",
      "description": "Simple Network Management Protocol (SNMP) is a widely used protocol for monitoring the health and welfare of network equipment, computer equipment and devices like UPSs. Net-SNMP is a suite of applications used to implement SNMPv1 (RFC 1157), SNMPv2 (RFCs 1901 -1908), and SNMPv3 (RFCs 3411 -3418) using both IPv4 and IPv6. Support for SNMPv2 classic (a.k. a. \"SNMPv2 historic\" - RFCs 1441 -1452) was dropped with the 4.0 release of the UCD -snmp package. The Simple Network Management Protocol (SNMP) server is used to listen for SNMP commands from an SNMP management system, execute the commands or collect the information and then send results back to the requesting system.",
      "rationale": "The SNMP server can communicate using SNMPv1 , which transmits data in the clear and does not require authentication to execute commands. SNMPv3 replaces the simple/clear text passwor d sharing used in SNMPv2 with more securely encoded parameters. If the the SNMP service is not required, the net-snmp package should be removed to reduce the attack surface of the system. Note: If SNMP is required:  The server should be configured for SNMP v3 only. User Authentication and Message Encryption should be configured.  If SNMP v2 is absolutely necessary, modify the community strings' values.",
      "remediation": ": Run the following command to remove net-snmpd : # yum remove net -snmp CIS Controls: Controls Version Control IG 1 IG 2 IG 3 v8 4.8 Uninstall or Disable Unnecessary Services on Enterprise Assets and Software Uninstall or disable unnecessary services on enterprise assets and software, such as an unused file sharing service, web application module, or service function. ● ● v7 2.6 Address unapproved software Ensure that unauthorized software is either removed or the inventory is updated in a timely manner ● ● ● v7 9.2 Ensure Only Approved Ports, Protocols and Services Are Running Ensure that only network ports, protocols, and services listening on a system with validated business needs, are running on each system. ● ● 186 | P a g e",
      "impact": "None",
      "audit_command": "Run the following command to verify net-snmp is not installed: # rpm -q net-snmp package net -snmp is not installed 185 | P a g e",
      "expected_status": "installed"
    },
    {
      "id": "2.2.14",
      "title": "Ensure NIS server is not installed",
      "section": "Section 2.2",
      "profile": "Level1",
      "automated": true,
      "type": "PackageInstalled",
      "severity": "medium",
      "cis_reference": "CIS CentOS Linux 7 Benchmark v3.1.2 - 2.2.14",
      "description": "The ypserv package provides the Network Information Service (NIS). This service, formally known as Yellow Pages, is a client -server directory service protocol for distributing system configuration files. The NIS server is a collection of programs that allow for the distribution of configuration files.",
      "rationale": "The NIS service is inherently an insecure system that has been vulnerable to DOS attacks, buffer overflows and has poor authentication for querying NIS maps. NIS generally has been replaced by such protocols as Lightweight Directory Access Protocol (LDAP). It is recommended that the ypserv package be removed, and if required a more secure services be used.",
      "remediation": ": Run the following command to remove ypserv : # yum remove ypserv 187 | P a g e CIS Controls: Controls Version Control IG 1 IG 2 IG 3 v8 4.8 Uninstall or Disable Unnecessary Services on Enterprise Assets and Software Uninstall or disable unnecessary services on enterprise assets and software, such as an unused file sharing service, web application module, or service function. ● ● v7 2.6 Address unapproved software Ensure that unauthorized software is either removed or the inventory is updated in a timely manner ● ● ● v7 9.2 Ensure Only Approved Ports, Protocols and Services Are Running Ensure that only network ports, protocols, and services listening on a system with validated business needs, are running on each system. ● ● 188 | P a g e",
      "impact": "None",
      "audit_command": "Run the following command to verify ypserv is not installed: # rpm -q ypserv package ypserv is no t installed",
      "expected_status": "installed"
    },
    {
      "id": "2.2.15",
      "title": "Ensure telnet -server is not installed",
      "section": "Section 2.2",
      "profile": "Level1",
      "automated": true,
      "type": "PackageInstalled",
      "severity": "medium",
      "cis_reference": "CIS CentOS Linux 7 Benchmark v3.1.2 - 2.2.15",
      "description": "The telnet-server package contains the telnet daemon, which accepts connections from users from other systems via the telnet protocol.",
      "rationale": "The telnet protocol is insecure and unencrypted. The use of an unencrypted transmission medium could allow a user with access to sniff network traffic the ability to steal credentials. The ssh package provides an encrypted session and stronger security.",
      "remediation": ": Run the following command to remove the telnet -server package: # yum remove telnet-server 189 | P a g e CIS Controls: Controls Version Control IG 1 IG 2 IG 3 v8 4.8 Uninstall or Disable Unnecessary Services on Enterprise Assets and Software Uninstall or disable unnecessary services on enterprise assets and software, such as an unused file sharing service, web application module, or service function. ● ● v7 2.6 Address unapproved software Ensure that unauthorized software is either removed or the inventory is updated in a timely manner ● ● ● v7 9.2 Ensure Only Approved Ports, Protocols and Services Are Running Ensure that only network ports, protocols, and services listening on a system with validated business needs, are running on each system. ● ● 190 | P a g e",
      "impact": "None",
      "audit_command": "Run the following command to verify the telnet-server package is not installed: rpm -q telnet -server package telnet -server is not installed",
      "expected_status": "installed"
    },
    {
      "id": "2.2.16",
      "title": "Ensure mail transfer agent is configured for local -only mode",
      "section": "Section 2.2",
      "profile": "Level1",
      "automated": true,
      "type": "Manual",
      "severity": "medium",
      "cis_reference": "CIS CentOS Linux 7 Benchmark v3.1.2 - 2.2.16",
      "description": "Ensure mail transfer agent is configured for local -only mode",
      "rationale": "Refer to CIS Benchmark documentation",
      "remediation": "Refer to CIS Benchmark documentation",
      "impact": "None",
      "audit_command": "Manual review required"
    },
    {
      "id": "2.2.17",
      "title": "Ensure nfs -utils is not installed or the nf s-server service is masked",
      "section": "Section 2.2",
      "profile": "Level1",
      "automated": true,
      "type": "PackageInstalled",
      "severity": "medium",
      "cis_reference": "CIS CentOS Linux 7 Benchmark v3.1.2 - 2.2.17",
      "description": "Ensure nfs -utils is not installed or the nf s-server service is masked",
      "rationale": "Refer to CIS Benchmark documentation",
      "remediation": "Refer to CIS Benchmark documentation",
      "impact": "None",
      "audit_command": "Manual review required",
      "expected_status": "installed"
    },
    {
      "id": "2.2.18",
      "title": "Ensure rpcbind is not installed or the rpcbind services are masked",
      "section": "Section 2.2",
      "profile": "Level1",
      "automated": true,
      "type": "PackageInstalled",
      "severity": "medium",
      "cis_reference": "CIS CentOS Linux 7 Benchmark v3.1.2 - 2.2.18",
      "description": "Ensure rpcbind is not installed or the rpcbind services are masked",
      "rationale": "Refer to CIS Benchmark documentation",
      "remediation": "Refer to CIS Benchmark documentation",
      "impact": "None",
      "audit_command": "Manual review required",
      "expected_status": "installed"
    },
    {
      "id": "2.2.19",
      "title": "Ensure rsync is not installed or the rsyncd service is masked",
      "section": "Section 2.2",
      "profile": "Level1",
      "automated": true,
      "type": "PackageInstalled",
      "severity": "medium",
      "cis_reference": "CIS CentOS Linux 7 Benchmark v3.1.2 - 2.2.19",
      "description": "Ensure rsync is not installed or the rsyncd service is masked",
      "rationale": "Refer to CIS Benchmark documentation",
      "remediation": "Refer to CIS Benchmark documentation",
      "impact": "None",
      "audit_command": "Manual review required",
      "expected_status": "installed"
    },
    {
      "id": "2.2.2",
      "title": "Ensure X11 Server components are not installed",
      "section": "Section 2.2",
      "profile": "Level1",
      "automated": true,
      "type": "PackageInstalled",
      "severity": "medium",
      "cis_reference": "CIS CentOS Linux 7 Benchmark v3.1.2 - 2.2.2",
      "description": "The X Window System provides a Graphical User Interface (GUI) where users can have multiple windows in which to run programs and various add on. The X Windows system is typically used on workstations where users login, but not on servers where users typically do not login.",
      "rationale": "Unless your organization specifically requires graphical login access via X Windows, remove it to reduce the potential attack surface. Impact: Many Linux systems run applications which require a Java runtime. Some Linux Java packages have a dependency on specific X Windows xorg -x11-fonts. One workaround to avoid this dependency is to use the \"headless\" Java packages for your specific Java runtime.",
      "remediation": ": Run the following command to remove the X Windows Server packages: # yum remove xorg -x11-server* 163 | P a g e CIS Controls: Controls Version Control IG 1 IG 2 IG 3 v8 4.8 Uninstall or Disable Unnecessary Services on Enterprise Assets and Software Uninstall or disable unnecessary services on enterprise assets and software, such as an unused file sharing service, web application module, or service function. ● ● v7 2.6 Address unapproved software Ensure that unauthorized software is either removed or the inventory is updated in a timely manner ● ● ● 164 | P a g e",
      "impact": "None",
      "audit_command": "Run the following command to Verify X Windo ws Server is not installed. # rpm -qa xorg-x11-server*",
      "expected_status": "installed"
    },
    {
      "id": "2.2.4",
      "title": "Ensure CUPS is not installed",
      "section": "Section 2.2",
      "profile": "Level1",
      "automated": true,
      "type": "PackageInstalled",
      "severity": "medium",
      "cis_reference": "CIS CentOS Linux 7 Benchmark v3.1.2 - 2.2.4",
      "description": "The Common Unix Print System (CUPS) provides the ability to print to both local and network printers. A system running CUPS can also accept print jobs from remote systems and pri nt them to local printers. It also provides a web based remote administration capability.",
      "rationale": "If the system does not need to print jobs or accept print jobs from other systems, it is recommended that CUPS be removed to reduce the potential attack surface. Note: Removing CUPS will prevent printing from the system Impact: Disabling CUPS will prevent printing from the system, a common task for workstation systems.",
      "remediation": "Run the following command to remove cups : # yum remove cups",
      "impact": "None",
      "audit_command": "Run the following command to verify cups is not installed: # rpm -q cups package cups is not installed",
      "expected_status": "installed"
    },
    {
      "id": "2.2.5",
      "title": "Ensure DHCP Server is not installed",
      "section": "Section 2.2",
      "profile": "Level1",
      "automated": true,
      "type": "PackageInstalled",
      "severity": "medium",
      "cis_reference": "CIS CentOS Linux 7 Benchmark v3.1.2 - 2.2.5",
      "description": "The Dynamic Host Configuration Protocol (DHCP) is a service that allows machines to be dynamically assigned IP addresses.",
      "rationale": "Unless a system is specifically set up to act as a DHCP server, it is recommended that the dhcp package be removed to reduce the potential attack surface.",
      "remediation": "Run the following command to remove dhcp : # yum remove dhcp",
      "impact": "None",
      "audit_command": "Run the following command to verify dhcp is not installed: # rpm -q dhcp package dhcp is not installed",
      "expected_status": "installed"
    },
    {
      "id": "2.2.6",
      "title": "Ensure LDAP server is not installed",
      "section": "Section 2.2",
      "profile": "Level1",
      "automated": true,
      "type": "PackageInstalled",
      "severity": "medium",
      "cis_reference": "CIS CentOS Linux 7 Benchmark v3.1.2 - 2.2.6",
      "description": "The Lightweight Directory Access Protocol (LDAP) was introduced as a replacement for NIS/YP. It is a service that provides a method for looking up information from a central database.",
      "rationale": "If the system will not need to act as an LDAP server, it is recommended that the software be removed to reduce the potential attack surface.",
      "remediation": "Run the following command to remove openldap -servers : # yum remove openldap -servers",
      "impact": "None",
      "audit_command": "Run the following command to verify openldap -servers is not installed: # rpm -q openldap -servers package openldap -servers is not i nstalled",
      "expected_status": "installed"
    },
    {
      "id": "2.2.7",
      "title": "Ensure DNS Server is not installed",
      "section": "Section 2.2",
      "profile": "Level1",
      "automated": true,
      "type": "PackageInstalled",
      "severity": "medium",
      "cis_reference": "CIS CentOS Linux 7 Benchmark v3.1.2 - 2.2.7",
      "description": "The Domain Name System (DNS) is a hierarchical naming system that maps names to IP addresses for computers, services and other resources connected to a network.",
      "rationale": "Unless a system is specifically designated to act as a DNS server, it is recommended that the package be removed to reduce the potential attack surface.",
      "remediation": ": Run the following command to remove bind : # yum remove bind 173 | P a g e CIS Controls: Controls Version Control IG 1 IG 2 IG 3 v8 4.8 Uninstall or Disable Unnecessary Services on Enterprise Assets and Software Uninstall or disable unnecessary services on enterprise assets and software, such as an unused file sharing service, web application module, or service function. ● ● v7 9.2 Ensure Only Approved Ports, Protocols and Services Are Running Ensure that only network ports, protocols, and services listening on a system with validated business needs, are running on each system. ● ● 174 | P a g e",
      "impact": "None",
      "audit_command": "Run one of the follow ing commands to verify bind is not installed: # rpm -q bind package bind is not installed",
      "expected_status": "installed"
    },
    {
      "id": "2.2.8",
      "title": "Ensure FTP Server is not installed",
      "section": "Section 2.2",
      "profile": "Level1",
      "automated": true,
      "type": "PackageInstalled",
      "severity": "medium",
      "cis_reference": "CIS CentOS Linux 7 Benchmark v3.1.2 - 2.2.8",
      "description": "FTP (File Transfer Protocol) is a traditional and widely used standard tool for transferring files between a server and clients over a network, especially where no authentication is necessary (permits anonymous users to connect to a server).",
      "rationale": "FTP does not protect the confidentiality of data or authentication credentials. It is recommended SFTP be used if file transfer is required. Unless there is a need to run the system as a FTP ser ver (for example, to allow anonymous downloads), it is recommended that the package be removed to reduce the potential attack surface. Note: Additional FTP servers also exist and should be removed if not required.",
      "remediation": ": Run the following command to remove vsftpd : # yum remove vsftpd 175 | P a g e CIS Controls: Controls Version Control IG 1 IG 2 IG 3 v8 4.8 Uninstall or Disable Unnecessary Services on Enterprise Assets and Software Uninstall or disable unnecessary services on enterprise assets and software, such as an unused file sharing service, web application module, or service function. ● ● v7 9.2 Ensure Only Approved Ports, Protocols and Services Are Running Ensure that only network ports, protocols, and services listening on a system with validated business needs, are running on each system. ● ● 176 | P a g e",
      "impact": "None",
      "audit_command": "Run the following command to verify vsftpd is not installed: # rpm -q vsftpd package vsftpd is not installed",
      "expected_status": "installed"
    },
    {
      "id": "2.2.9",
      "title": "Ensure HTTP server is not installed",
      "section": "Section 2.2",
      "profile": "Level1",
      "automated": true,
      "type": "PackageInstalled",
      "severity": "medium",
      "cis_reference": "CIS CentOS Linux 7 Benchmark v3.1.2 - 2.2.9",
      "description": "HTTP or web servers provide the ability to host web site content.",
      "rationale": "Unless there is a need to run the system as a web server, it is recommended that the package be removed to reduce the potential attack surface. Notes:  Several http servers exist. apache , apache2 , lighttpd , and nginx are example packages that provide an HTTP server.  These and other packages should also be audited, and removed if not required.",
      "remediation": ": Run the following command to remove httpd : # yum remove httpd 177 | P a g e CIS Controls: Controls Version Control IG 1 IG 2 IG 3 v8 4.8 Uninstall or Disable Unnecessary Services on Enterprise Assets and Software Uninstall or disable unnecessary services on enterprise assets and software, such as an unused file sharing service, web application module, or service function. ● ● v7 9.2 Ensure Only Approved Ports, Protocols and Services Are Running Ensure that only network ports, protocols, and services listening on a system with validated business needs, are running on each system. ● ● 178 | P a g e",
      "impact": "None",
      "audit_command": "Run the following command to ve rify httpd is not installed: # rpm -q httpd package httpd is not installed",
      "expected_status": "installed"
    }
  ]
}