{
  "milestone": "5.5",
  "title": "User Accounts and Environment",
  "controls": [
    {
      "control_id": "5.5.1",
      "title": "Ensure default user shell timeout is 900 seconds or less",
      "level": 1,
      "scored": true,
      "profile_applicability": "Level 1 - Server, Level 1 - Workstation",
      "description": "The default TMOUT determines the shell timeout for users. The TMOUT value is measured in seconds.",
      "rationale": "Having no timeout value associated with a shell could allow an unauthorized user to access another user's shell session (e.g. user walks away from their computer and doesn't lock the screen). Setting a timeout value at least reduces the risk of this happening.",
      "audit": "Run the following commands and verify TMOUT is 900 or less:\n# grep -E '^TMOUT' /etc/bashrc /etc/profile /etc/profile.d/*.sh\nTMOUT=900\n# grep -E '^readonly TMOUT' /etc/bashrc /etc/profile /etc/profile.d/*.sh\nreadonly TMOUT\n# grep -E '^export TMOUT' /etc/bashrc /etc/profile /etc/profile.d/*.sh\nexport TMOUT",
      "remediation": "Edit the /etc/bashrc and /etc/profile files (and the appropriate files in /etc/profile.d) and add or edit any TMOUT parameters to be 900 or less:\nTMOUT=900\nreadonly TMOUT\nexport TMOUT",
      "impact": "The remediation measures may impact some user sessions, but will improve security.",
      "default_value": "N/A",
      "references": "1. See the bash(1) man page for more information.",
      "cis_controls": "v8: 4.3 Configure Automatic Session Locking on Enterprise Assets\nv7: 16.11 Lock Workstation Sessions After Inactivity",
      "check_type": "Manual",
      "check_value": ""
    },
    {
      "control_id": "5.5.2",
      "title": "Ensure default user umask is 027 or more restrictive",
      "level": 1,
      "scored": true,
      "profile_applicability": "Level 1 - Server, Level 1 - Workstation",
      "description": "The default umask determines the permissions of files created by users. The user creating the file has the discretion of making their files and directories readable by others via the chmod command.",
      "rationale": "Setting a very secure default value for umask ensures that users make a conscious choice about their file permissions. A default umask setting of 077 causes files and directories created by users to not be readable by any other user on the system. A umask of 027 would make files and directories readable by users in the same Unix group, while a umask of 022 would make files readable by every user on the system.",
      "audit": "Run the following commands and verify umask is 027 or more restrictive:\n# grep -E '^\\s*umask' /etc/bashrc /etc/profile /etc/profile.d/*.sh\numask 027",
      "remediation": "Edit the /etc/bashrc and /etc/profile files (and the appropriate files in /etc/profile.d) and add or edit any umask parameters as follows:\numask 027",
      "impact": "None",
      "default_value": "umask 022",
      "references": "1. See the bash(1) man page for more information.",
      "cis_controls": "v8: 3.3 Configure Data Access Control Lists\nv7: 14.6 Protect Information through Access Control Lists",
      "check_type": "Manual",
      "check_value": ""
    },
    {
      "control_id": "5.5.3",
      "title": "Ensure default group for the root account is GID 0",
      "level": 1,
      "scored": true,
      "profile_applicability": "Level 1 - Server, Level 1 - Workstation",
      "description": "The usermod command can be used to specify which group the root user belongs to. This affects permissions of files that are created by the root user.",
      "rationale": "Using GID 0 for the root account helps prevent root-owned files from accidentally becoming accessible to non-privileged users.",
      "audit": "Run the following command and verify the result is 0:\n# grep '^root:' /etc/passwd | cut -f4 -d:\n0",
      "remediation": "Run the following command to set the root user default group to GID 0:\n# usermod -g 0 root",
      "impact": "None",
      "default_value": "GID 0",
      "references": "1. See the usermod(8) man page for more information.",
      "cis_controls": "v8: 5.4 Restrict Administrator Privileges to Dedicated Administrator Accounts\nv7: 4.3 Ensure the Use of Dedicated Administrative Accounts",
      "check_type": "Manual",
      "check_value": ""
    },
    {
      "control_id": "5.5.4",
      "title": "Ensure default user shell timeout is configured",
      "level": 1,
      "scored": true,
      "profile_applicability": "Level 1 - Server, Level 1 - Workstation",
      "description": "TMOUT is an environmental setting that determines the timeout of a shell in seconds.",
      "rationale": "Setting a timeout value reduces the window of opportunity for unauthorized user access to another user's shell session that has been left unattended. It also ends the inactive session and releases the resources associated with that session.",
      "audit": "Run the following command and verify TMOUT is 900 or less and is readonly and exported:\n# grep -E '^TMOUT' /etc/bashrc /etc/profile /etc/profile.d/*.sh",
      "remediation": "Edit the /etc/bashrc, /etc/profile and /etc/profile.d/*.sh files and add or edit the TMOUT parameter:\nTMOUT=900\nreadonly TMOUT\nexport TMOUT",
      "impact": "None",
      "default_value": "N/A",
      "references": "1. See the bash(1) man page for more information.",
      "cis_controls": "v8: 4.3 Configure Automatic Session Locking on Enterprise Assets\nv7: 16.11 Lock Workstation Sessions After Inactivity",
      "check_type": "Manual",
      "check_value": ""
    }
  ]
}
