{
  "milestone": "2.2 Configure Client Services",
  "version": "1.0.0",
  "description": "Ubuntu 22.04 LTS CIS Benchmark - Section 2.2 Configure Client Services",
  "controls": [
    {
      "id": "2.2.1",
      "title": "Ensure nis client is not installed",
      "section": "Services",
      "description": "The Network Information Service (NIS), formerly known as Yellow Pages, is a client-server directory service protocol used to distribute system configuration files.",
      "rationale": "The NIS service is inherently an insecure system that has been vulnerable to DOS attacks, buffer overflows and has poor authentication for querying NIS maps. NIS generally has been replaced by such protocols as Lightweight Directory Access Protocol (LDAP). It is recommended that the service be removed.",
      "impact": "Removing the NIS client will prevent the system from using NIS for authentication or directory services.",
      "remediation": "Run the following command to remove nis: apt purge nis",
      "profile": "Level1",
      "type": "Package",
      "package_name": "nis",
      "should_be_installed": false
    },
    {
      "id": "2.2.2",
      "title": "Ensure rsh client is not installed",
      "section": "Services",
      "description": "The rsh package contains the client commands for the rsh services.",
      "rationale": "These legacy clients contain numerous security exposures and have been replaced with the more secure SSH package. Even if the server is removed, it is best to ensure the clients are also removed to prevent users from inadvertently attempting to use these commands and therefore exposing their credentials.",
      "impact": "Removing the rsh client will prevent users from using rsh, rlogin, and rcp commands.",
      "remediation": "Run the following command to remove rsh-client: apt purge rsh-client",
      "profile": "Level1",
      "type": "Package",
      "package_name": "rsh-client",
      "should_be_installed": false
    },
    {
      "id": "2.2.3",
      "title": "Ensure talk client is not installed",
      "section": "Services",
      "description": "The talk software makes it possible for users to send and receive messages across systems through a terminal session.",
      "rationale": "The software presents a security risk as it uses unencrypted protocols for communication.",
      "impact": "Removing the talk client will prevent users from using the talk command for communication.",
      "remediation": "Run the following command to remove talk: apt purge talk",
      "profile": "Level1",
      "type": "Package",
      "package_name": "talk",
      "should_be_installed": false
    },
    {
      "id": "2.2.4",
      "title": "Ensure telnet client is not installed",
      "section": "Services",
      "description": "The telnet package contains the telnet client, which allows users to start connections to other systems via the telnet protocol.",
      "rationale": "The telnet protocol is insecure and unencrypted. The use of an unencrypted transmission medium could allow an unauthorized user to steal credentials. The ssh package provides an encrypted session and stronger security and is included in most Linux distributions.",
      "impact": "Removing the telnet client will prevent users from using telnet for remote connections.",
      "remediation": "Run the following command to remove telnet: apt purge telnet",
      "profile": "Level1",
      "type": "Package",
      "package_name": "telnet",
      "should_be_installed": false
    },
    {
      "id": "2.2.5",
      "title": "Ensure ldap client is not installed",
      "section": "Services",
      "description": "The Lightweight Directory Access Protocol (LDAP) was introduced as a replacement for NIS/YP. It is a service that provides a method for looking up information from a central database.",
      "rationale": "If the system will not need to act as an LDAP client, it is recommended that the software be removed to reduce the potential attack surface.",
      "impact": "Removing the LDAP client will prevent the system from using LDAP for authentication or directory services.",
      "remediation": "Run the following command to remove ldap-utils: apt purge ldap-utils",
      "profile": "Level1",
      "type": "Package",
      "package_name": "ldap-utils",
      "should_be_installed": false
    },
    {
      "id": "2.2.6",
      "title": "Ensure ftp client is not installed",
      "section": "Services",
      "description": "The ftp package provides the ftp client utility.",
      "rationale": "FTP does not protect the confidentiality of data or authentication credentials. It is recommended sftp be used if file transfer is required. Unless there is a need to run the system as a FTP client, it is recommended that the package be removed to reduce the potential attack surface.",
      "impact": "Removing the FTP client will prevent users from using FTP for file transfers.",
      "remediation": "Run the following command to remove ftp: apt purge ftp",
      "profile": "Level1",
      "type": "Package",
      "package_name": "ftp",
      "should_be_installed": false
    }
  ]
}