{
  "milestone": "5.4 User Accounts and Environment",
  "version": "1.0.0",
  "description": "Ubuntu 22.04 LTS CIS Benchmark - Section 5.4 User Accounts and Environment",
  "controls": [
    {
      "id": "5.4.1.1",
      "title": "Ensure password expiration is configured",
      "section": "Access Control",
      "profile": "Level1",
      "type": "ConfigFile",
      "file_path": "/etc/login.defs",
      "pattern": "PASS_MAX_DAYS\\s+([1-9]|[1-9][0-9]|[1-2][0-9][0-9]|3[0-5][0-9]|36[0-5])",
      "expected_match": true,
      "cis_reference": "https://www.cisecurity.org/benchmark/ubuntu_linux",
      "cis_control_id": "5.4.1.1",
      "description": "The PASS_MAX_DAYS parameter in /etc/login.defs allows an administrator to force passwords to expire once they reach a defined age.\nPASS_MAX_DAYS <N> - The maximum number of days a password may be used. If the password is older than this, a password change will be forced. If not specified, -1 will be assumed (which disables the restriction).",
      "remediation": "Set the PASS_MAX_DAYS parameter to conform to site policy in /etc/login.defs :\nPASS_MAX_DAYS 365\nModify user parameters for all users with a password set to match:\n# chage --maxdays 365 <user>\nEdit /etc/login.defs and set PASS_MAX_DAYS to a value greater than 0 that follows local site policy:\nExample:\nPASS_MAX_DAYS 365\nRun the following command to modify user parameters for all users with a password set to a maximum age no greater than 365 or less than 1 that follows local site policy:\n# chage --maxdays <N> <user> Example:\n# awk -F: '($2~/^ \\$.+\\$/) if($5 > 365 || $5 < 1)system (\"chage --maxdays 365 \" $1)' /etc/shadow Warning: If a password has been set at system install or kickstart, the last change date field is not set, In this case, setting PASS_MAX_DAYS will immediately expire the password. One possible solution is to populate the last change date field through a command like: chage -d \"$(date +%Y -%m-%d)\" root",
      "automated": true
    },
    {
      "id": "5.4.1.3",
      "title": "Ensure password expiration warning days is configured",
      "section": "Access Control",
      "profile": "Level1",
      "type": "ConfigFile",
      "file_path": "/etc/login.defs",
      "pattern": "PASS_WARN_AGE\\s+([7-9]|[1-9][0-9])",
      "expected_match": true,
      "cis_reference": "https://www.cisecurity.org/benchmark/ubuntu_linux",
      "cis_control_id": "5.4.1.3",
      "description": "The PASS_WARN_AGE parameter in /etc/login.defs allows an administrator to notify users that their password will expire in a defined number of days.\nPASS_WARN_AGE <N> - The number of days warning given before a password expires. A zero means warning is given only upon the day of expiration, a negative value means no warning is given. If not specified, no warning will be provided.",
      "remediation": "Edit /etc/login.defs and set PASS_WARN_AGE to a value of 7 or more that follows local site policy:\nExample:\nPASS_WARN_AGE 7\nRun the following command to modify user parameters for all users with a password set to a minimum warning to 7 or more days that follows local site policy:\n# chage --warndays <N> <user> Example:\n# awk -F: '($2~/^ \\$.+\\$/) if($6 < 7)system (\"chage --warndays 7 \" $1)' /etc/shadow",
      "automated": true
    },
    {
      "id": "5.4.1.4",
      "title": "Ensure strong password hashing algorithm is configured",
      "section": "Access Control",
      "profile": "Level1",
      "type": "ConfigFile",
      "file_path": "/etc/login.defs",
      "pattern": "ENCRYPT_METHOD\\s+SHA512",
      "expected_match": true,
      "cis_reference": "https://www.cisecurity.org/benchmark/ubuntu_linux",
      "cis_control_id": "5.4.1.4",
      "description": "A cryptographic hash function converts an arbitrary -length input into a fixed length output. Password hashing performs a one -way transformation of a password, turning the password into another string, called the hashed password.\nENCRYPT_METHOD (string) - This defines the system default encryption algorithm for encrypting passwords (if no algorithm are specified on the command line). It can take one of these values:\n• MD5 - MD5 -based algorithm will be used for encrypting password • SHA256 - SHA256 -based algorithm will be used for encrypting password • SHA512 - SHA512 -based algorithm will be used for encrypting password • BCRYPT - BCRYPT -based algorithm will be used for encrypting password • YESCRYPT - YESCRYPT -based algorithm will be used for encrypting password • DES - DES-based algorithm will be used for encrypting password (default) Note:\n• This parameter overrides the deprecated MD5_CRYPT_ENAB variable.\n• This parameter will only affect the generation of group passwords.\n• The generation of user passwords is done by PAM and subject to the PAM configuration.\n• It is recommended to set this variable consistently with the PAM configuration.",
      "remediation": "Edit /etc/login.defs and set the ENCRYPT_METHOD to SHA512 or YESCRYPT :\nENCRYPT_METHOD <HASHING_ALGORITHM> Example:\nENCRYPT_METHOD YESCRYPT Note:\n• This only effects local groups' passwords created after updating the file to use sha512 or yescrypt .\n• If it is determined that the password algorithm being used is not sha512 or yescrypt , once it is changed, it is recommended that all group passwords be updated to use the stronger hashing algorithm.\n• It is recommended that the chosen hashing algorithm is consistent across /etc/login.defs and the PAM configuration",
      "automated": true
    },
    {
      "id": "5.4.1.5",
      "title": "Ensure inactive password lock is configured",
      "section": "Access Control",
      "profile": "Level1",
      "type": "ConfigFile",
      "file_path": "/etc/default/useradd",
      "pattern": "INACTIVE=([1-2][0-9]|30)",
      "expected_match": true,
      "cis_reference": "https://www.cisecurity.org/benchmark/ubuntu_linux",
      "cis_control_id": "5.4.1.5",
      "description": "User accounts that have been inactive for over a given period of time can be automatically disabled.\nINACTIVE - Defines the number of days after the password exceeded its maximum age where the user is expected to replace this password.\nThe value is stored in the shadow password file. An input of 0 will disable an expired password with no delay. An input of -1 will blank the respective field in the shadow password file.",
      "remediation": "Run the following command to set the default password inactivity period to 45 days or less that meets local site policy:\n# useradd -D -f <N> Example:\n# useradd -D -f 45\nRun the following command to modify user parameters for all users with a password set to a inactive age of 45 days or less that follows local site policy:\n# chage --inactive <N> <user> Example:\n# awk -F: '($2~/^ \\$.+\\$/) if($7 > 45 || $7 < 0)system (\"chage --inactive 45 \" $1)' /etc/shadow",
      "automated": true
    },
    {
      "id": "5.4.2.1",
      "title": "Ensure root is the only UID 0 account",
      "section": "Access Control",
      "profile": "Level1",
      "type": "DuplicateUIDs",
      "passwd_file": "/etc/passwd",
      "cis_reference": "https://www.cisecurity.org/benchmark/ubuntu_linux",
      "cis_control_id": "5.4.2.1",
      "description": "Any account with UID 0 has superuser privileges on the system.",
      "remediation": "Run the following command to change the root account UID to 0:\n# usermod -u 0 root\nModify any users other than root with UID 0 and assign them a new UID.",
      "automated": true
    },
    {
      "id": "5.4.2.7",
      "title": "Ensure system accounts do not have a valid login shell",
      "section": "Access Control",
      "profile": "Level1",
      "type": "CommandOutputEmpty",
      "cis_reference": "https://www.cisecurity.org/benchmark/ubuntu_linux",
      "cis_control_id": "5.4.2.7",
      "description": "There are a number of accounts provided with most distributions that are used to manage applications and are not intended to provide an interactive shell. Furthermore, a user may add special accounts that are not intended to provide an interactive shell.",
      "remediation": "Run the following command to set the shell for any service accounts returned by the audit to nologin :\n# usermod -s $(command -v nologin) <user> Example script:\n#!/usr/bin/env bash l_valid_shells=\"^($( awk -F\\/ '$NF != \"nologin\" print' /etc/shells | sed -rn '/^\\//s,/,\\\\\\\\/,g;p' | paste -s -d '|' - ))$\" awk -v pat=\"$l_valid_shells\" -F:\n'($1!~/^(root|halt|sync|shutdown|nfsnobody)$/ && ($3<'\"$(awk '/^*UID_MIN/print $2' /etc/login.defs)\"' || $3 == 65534) && $(NF) ~ pat) system (\"usermod -s '\"$(command -v nologin)\"' \" $1)' /etc/passwd",
      "automated": true,
      "audit_command": "awk -F: '($1!~/^(root|halt|sync|shutdown)$/ && ($3<1000 || $3==65534) && $7!~/^(\\/usr\\/sbin\\/nologin|\\/sbin\\/nologin|\\/bin\\/false)$/) {print $1\":\"$3\":\"$7}' /etc/passwd"
    },
    {
      "id": "5.4.3.1",
      "title": "Ensure nologin is not listed in /etc/shells",
      "section": "Access Control",
      "profile": "Level1",
      "type": "ConfigFile",
      "file_path": "/etc/shells",
      "pattern": "/usr/sbin/nologin|/sbin/nologin",
      "expected_match": false,
      "cis_reference": "https://www.cisecurity.org/benchmark/ubuntu_linux",
      "cis_control_id": "5.4.3.1",
      "description": "/etc/shells is a text file which contains the full pathnames of valid login shells. This file is consulted by chsh and available to be queried by other programs.\nBe aware that there are programs which consult this file to find out if a user is a normal user; for example, FTP daemons traditionally disallow access to users with shells not included in this file.",
      "remediation": "Edit /etc/shells and remove any lines that include nologin",
      "automated": true
    },
    {
      "id": "5.4.3.2",
      "title": "Ensure default user shell timeout is configured",
      "section": "Access Control",
      "profile": "Level1",
      "type": "ConfigFile",
      "file_path": "/etc/bash.bashrc",
      "pattern": "TMOUT=([1-8][0-9][0-9]|900)",
      "expected_match": true,
      "cis_reference": "https://www.cisecurity.org/benchmark/ubuntu_linux",
      "cis_control_id": "5.4.3.2",
      "description": "TMOUT is an environmental setting that determines the timeout of a shell in seconds.\n• TMOUT= n - Sets the shell timeout to n seconds. A setting of TMOUT=0 disables timeout.\n• readonly TMOUT - Sets the TMOUT environmental variable as readonly, preventing unwanted modification during run -time.\n• export TMOUT - exports the TMOUT variable System Wide Shell Configuration Files:\n• /etc/profile - used to set system wide environmental variables on users shells. The variables are sometimes the same ones that are in the .bash_profile , however this file is used to set an initial PATH or PS1 for all shell users of the system. is only executed for interactive login shells, or shells executed with the --login parameter.\n• /etc/profile.d - /etc/profile will execute the scripts within /etc/profile.d/*.sh . It is recommended to place your configuration in a shell script within /etc/profile.d to set your own system wide environmental variables.\n• /etc/bash.bashrc - System wide version of .bashrc . In Fedora derived distributions, /etc/bashrc also invokes /etc/profile.d/*.sh if non-login shell, but redirects output to /dev/null if non-interactive. Is only executed for interactive shells or if BASH_ENV is set to /etc/bash.bashrc .",
      "remediation": "Review /etc/bashrc , /etc/profile , and all files ending in *.sh in the /etc/profile.d/ directory and remove or edit all TMOUT=_n_ entries to follow local site policy. TMOUT should not exceed 900 or be equal to 0.\nConfigure TMOUT in one of the following files:\n• A file in the /etc/profile.d/ directory ending in .sh • /etc/profile • /etc/bashrc Example command to set TMOUT to 900 seconds in a file in /etc/profile.d/ :\n# printf '%s ' \"# Set TMOUT to 900 seconds\" \"typeset -xr TMOUT=900\" > /etc/profile.d/50 -tmout.sh TMOUT configuration examples:\ntypeset -xr TMOUT=900 Deprecated methods:\n• As multiple lines:\nTMOUT=900 readonly TMOUT export TMOUT • As a single line:\nreadonly TMOUT=900 ; export TMOUT\nAdditional Information:\nThe audit and remediation in this recommendation apply to bash and shell. If other shells are supported on the system, it is recommended that their configuration files also are checked. Other methods of setting a timeout exist for other shells not covered here.\nEnsure that the timeout conforms to your local policy.\nInternal Only - General",
      "automated": true
    },
    {
      "id": "5.4.3.3",
      "title": "Ensure default user umask is configured",
      "section": "Access Control",
      "profile": "Level1",
      "type": "ConfigFile",
      "file_path": "/etc/bash.bashrc",
      "pattern": "umask\\s+(0[0-2][0-7]|[0-2][0-7])",
      "expected_match": true,
      "cis_reference": "https://www.cisecurity.org/benchmark/ubuntu_linux",
      "cis_control_id": "5.4.3.3",
      "description": "The user file -creation mode mask ( umask ) is used to determine the file permission for newly created directories and files. In Linux, the default permissions for any newly created directory is 0777 ( rwxrwxrwx ), and for any newly created file it is 0666 ( rw-rw- rw-). The umask modifies the default Linux permissions by restricting (masking) these permissions. The umask is not simply subtracted, but is processed bitwise. Bits set in the umask are cleared in the resulting file mode.\numask can be set with either Octal or Symbolic values:\n• Octal (Numeric) Value - Represented by either three or four digits. ie umask 0027 or umask 027 . If a four digit umask is used, the first digit is ignored. The remaining three digits effect the resulting permissions for user, group, and world/other respectively.\n• Symbolic Value - Represented by a comma separated list for User u, group g, and world/other o. The permissions listed are not masked by umask . ie a umask set by umask u=rwx,g=rx,o= is the Symbolic equivalent of the Octal umask 027. This umask would set a newly created directory with file mode drwxr-x--- and a newly created file with file mode rw-r----- .\nThe default umask can be set to use the pam_umask module or in a System Wide Shell Configuration File . The user creating the directories or files has the discretion of changing the permissions via the chmod command, or choosing a different default umask by adding the umask command into a User Shell Configuration File , ( .bash_profile or .bashrc ), in their home directory.\nSetting the default umask:\n• pam_umask module:\no will set the umask according to the system default in /etc/login.defs and user settings, solving the problem of different umask settings with different shells, display managers, remote sessions etc.\no umask=<mask> value in the /etc/login.defs file is interpreted as Octal o Setting USERGROUPS_ENAB to yes in /etc/login.defs (default):\n▪ will enable setting of the umask group bits to be the same as owner bits. (examples: 022 -> 002, 077 -> 007) for non -root users, if the uid is the same as gid, and username is the same as the <primary group name>  Internal Only - General ▪ userdel will remove the user's group if it contains no more members, and useradd will create by default a group with the name of the user • System Wide Shell Configuration File :\no /etc/profile - used to set system wide environmental variables on users shells. The variables are sometimes the same ones that are in the .bash_profile , however this file is used to set an initial PATH or PS1 for all shell users of the system. is only executed for interactive login shells, or shells executed with the --login parameter.\no /etc/profile.d - /etc/profile will execute the scripts within /etc/profile.d/*.sh . It is recommended to place your configuration in a shell script within /etc/profile.d to set your own system wide environmental variables.\no /etc/bashrc - System wide version of .bashrc . In Fedora derived distributions, etc/bashrc also invokes /etc/profile.d/*.sh if non-login shell, but redirects output to /dev/null if non-interactive. Is only executed for interactive shells or if BASH_ENV is set to /etc/bashrc .\nUser Shell Configuration Files:\n• ~/.bash_profile - Is executed to configure your shell before the initial command prompt. Is only read by login shells.\n• ~/.bashrc - Is executed for interactive shells. only read by a shell that's both interactive and non -login umask is set by order of precedence. If umask is set in multiple locations, this order of precedence will determine the system's default umask .\nOrder of precedence:\n1. A file in /etc/profile.d/ ending in .sh - This will override any other system - wide umask setting 2. In the file /etc/profile 3. On the pam_umask.so module in /etc/pam.d/postlogin 4. In the file /etc/login.defs 5. In the file /etc/default/login",
      "remediation": "1. Run the following script to comment out all occurrences of umask that are less restrictive than 027 in files ending in *.sh in the /etc/profile.d/ directory:\n#!/usr/bin/env bash while IFS= read -r -d $'\\0' l_file; do sed -ri '/^*umask+0?(0[01][0 -7]|0[0-7][^7]|[^0][0 -7][0- 7])(*|+.*)$/s/^/# /' \"$l_file\" done < <(find /etc/profile.d/ -type f -name '*.sh' -print0) 2. Create or edit a file in /etc/profile.d/ ending in *.sh and add or modify the following line:\numask 0027 Example:\n# printf '%s ' \"\" \"umask 027\" >> /etc/profile.d/60 -default_umask.sh 3. Edit /etc/login.defs and add or update the following line:\nUMASK 027 Notes:\n• This method only applies to bash and shell. If other shells are supported on the system, it is recommended that their configuration files also are checked • If the pam_umask.so module is going to be used to set umask , ensure that it's not being overridden by another setting. Refer to the PAM_UMASK(8) man page for more information Internal Only - General",
      "automated": true
    }
  ]
}