{
  "milestone": "2.1 Configure Server Services",
  "version": "1.0.0",
  "description": "Ubuntu 22.04 LTS CIS Benchmark - Section 2.1 Configure Server Services",
  "controls": [
    {
      "id": "2.1.1",
      "title": "Ensure autofs services are not in use",
      "section": "Services",
      "description": "autofs allows automatic mounting of devices, typically including CD/DVDs and USB drives.",
      "rationale": "With automounting enabled anyone with physical access could attach a USB drive or disc and have its contents available in system even if they lacked permissions to mount it themselves.",
      "impact": "The use of portable hard drives is very common for workstation users. If your organization allows the use of portable storage or media on workstations and physical access controls to workstations is considered adequate there is little value add in turning off automounting.",
      "remediation": "Run the following commands to disable autofs: systemctl --now disable autofs, apt purge autofs",
      "profile": "Level1",
      "type": "ServiceNotInUse",
      "service_names": ["autofs"],
      "package_names": ["autofs"]
    },
    {
      "id": "2.1.2",
      "title": "Ensure avahi daemon services are not in use",
      "section": "Services",
      "description": "Avahi is a free zeroconf implementation, including a system for multicast DNS/DNS-SD service discovery.",
      "rationale": "Automatic discovery of network services is not normally required for system functionality. It is recommended to disable the service to reduce the potential attack surface.",
      "impact": "Disabling avahi will prevent the system from automatically discovering network services.",
      "remediation": "Run the following commands to disable avahi-daemon: systemctl --now disable avahi-daemon, apt purge avahi-daemon",
      "profile": "Level1",
      "type": "ServiceNotInUse",
      "service_names": ["avahi-daemon"],
      "package_names": ["avahi-daemon"]
    },
    {
      "id": "2.1.3",
      "title": "Ensure dhcp server services are not in use",
      "section": "Services",
      "description": "The Dynamic Host Configuration Protocol (DHCP) is a service that allows machines to be dynamically assigned IP addresses.",
      "rationale": "Unless a system is specifically set up to act as a DHCP server, it is recommended that this service be disabled to reduce the potential attack surface.",
      "impact": "Disabling DHCP server will prevent the system from acting as a DHCP server.",
      "remediation": "Run the following commands to disable dhcp: systemctl --now disable isc-dhcp-server, systemctl --now disable isc-dhcp-server6, apt purge isc-dhcp-server",
      "profile": "Level1",
      "type": "ServiceNotInUse",
      "service_names": ["isc-dhcp-server", "isc-dhcp-server6"],
      "package_names": ["isc-dhcp-server"]
    },
    {
      "id": "2.1.4",
      "title": "Ensure dns server services are not in use",
      "section": "Services",
      "description": "The Domain Name System (DNS) is a hierarchical naming system that maps names to IP addresses for computers, services and other resources connected to a network.",
      "rationale": "Unless a system is specifically designated to act as a DNS server, it is recommended that the service be disabled to reduce the potential attack surface.",
      "impact": "Disabling DNS server will prevent the system from acting as a DNS server.",
      "remediation": "Run the following commands to disable bind9: systemctl --now disable bind9, apt purge bind9",
      "profile": "Level1",
      "type": "ServiceNotInUse",
      "service_names": ["bind9"],
      "package_names": ["bind9"]
    },
    {
      "id": "2.1.5",
      "title": "Ensure dnsmasq services are not in use",
      "section": "Services",
      "description": "dnsmasq is a lightweight DNS forwarder and DHCP server.",
      "rationale": "Unless a system is specifically designated to act as a DNS forwarder and/or DHCP server, it is recommended that dnsmasq be disabled to reduce the potential attack surface.",
      "impact": "Disabling dnsmasq will prevent the system from acting as a DNS forwarder or DHCP server.",
      "remediation": "Run the following commands to disable dnsmasq: systemctl --now disable dnsmasq, apt purge dnsmasq",
      "profile": "Level1",
      "type": "ServiceNotInUse",
      "service_names": ["dnsmasq"],
      "package_names": ["dnsmasq"]
    },
    {
      "id": "2.1.6",
      "title": "Ensure ftp server services are not in use",
      "section": "Services",
      "description": "The File Transfer Protocol (FTP) provides networked computers with the ability to transfer files.",
      "rationale": "FTP does not protect the confidentiality of data or authentication credentials. It is recommended sftp be used if file transfer is required. Unless there is a need to run the system as a FTP server (for example, to allow anonymous downloads), it is recommended that the service be disabled to reduce the potential attack surface.",
      "impact": "Disabling FTP server will prevent the system from acting as an FTP server.",
      "remediation": "Run the following commands to disable vsftpd: systemctl --now disable vsftpd, apt purge vsftpd",
      "profile": "Level1",
      "type": "ServiceNotInUse",
      "service_names": ["vsftpd"],
      "package_names": ["vsftpd"]
    },
    {
      "id": "2.1.7",
      "title": "Ensure ldap server services are not in use",
      "section": "Services",
      "description": "The Lightweight Directory Access Protocol (LDAP) was introduced as a replacement for NIS/YP. It is a service that provides a method for looking up information from a central database.",
      "rationale": "If the system will not need to act as an LDAP server, it is recommended that the software be disabled to reduce the potential attack surface.",
      "impact": "Disabling LDAP server will prevent the system from acting as an LDAP server.",
      "remediation": "Run the following commands to disable slapd: systemctl --now disable slapd, apt purge slapd",
      "profile": "Level1",
      "type": "ServiceNotInUse",
      "service_names": ["slapd"],
      "package_names": ["slapd"]
    },
    {
      "id": "2.1.8",
      "title": "Ensure message access server services are not in use",
      "section": "Services",
      "description": "dovecot and cyrus-imap are software packages that can be used to provide IMAP or POP3 services.",
      "rationale": "Unless POP3 and/or IMAP servers are to be provided by this system, it is recommended that the service be disabled to reduce the potential attack surface.",
      "impact": "Disabling message access server will prevent the system from providing IMAP or POP3 services.",
      "remediation": "Run the following commands to disable dovecot and cyrus-imap: systemctl --now disable dovecot, systemctl --now disable cyrus-imap, apt purge dovecot-imapd dovecot-pop3d cyrus-imap",
      "profile": "Level1",
      "type": "ServiceNotInUse",
      "service_names": ["dovecot", "cyrus-imap"],
      "package_names": ["dovecot-imapd", "dovecot-pop3d", "cyrus-imap"]
    },
    {
      "id": "2.1.9",
      "title": "Ensure network file system services are not in use",
      "section": "Services",
      "description": "The Network File System (NFS) is one of the first and most widely distributed file systems in the UNIX environment. It provides the ability for systems to mount file systems of other servers through the network.",
      "rationale": "If the system does not export NFS shares or act as an NFS client, it is recommended that these services be disabled to reduce remote attack surface.",
      "impact": "Disabling NFS will prevent the system from sharing or accessing NFS file systems.",
      "remediation": "Run the following commands to disable nfs: systemctl --now disable nfs-server, apt purge nfs-kernel-server",
      "profile": "Level1",
      "type": "ServiceNotInUse",
      "service_names": ["nfs-server"],
      "package_names": ["nfs-kernel-server"]
    },
    {
      "id": "2.1.10",
      "title": "Ensure nis server services are not in use",
      "section": "Services",
      "description": "The Network Information Service (NIS) (formally known as Yellow Pages) is a client-server directory service protocol for distributing system configuration files.",
      "rationale": "The NIS service is inherently an insecure system that has been vulnerable to DOS attacks, buffer overflows and has poor authentication for querying NIS maps. NIS generally been replaced by such protocols as Lightweight Directory Access Protocol (LDAP). It is recommended that the service be disabled and other, more secure services be used",
      "impact": "Disabling NIS server will prevent the system from acting as a NIS server.",
      "remediation": "Run the following commands to disable nis: systemctl --now disable nis, apt purge nis",
      "profile": "Level1",
      "type": "ServiceNotInUse",
      "service_names": ["nis"],
      "package_names": ["nis"]
    },
    {
      "id": "2.1.11",
      "title": "Ensure print server services are not in use",
      "section": "Services",
      "description": "The Common UNIX Print System (CUPS) provides the ability to print to both local and network printers. A system running CUPS can also accept print jobs from remote systems and print them to local printers.",
      "rationale": "If the system does not need to print jobs or accept print jobs from other systems, it is recommended that CUPS be disabled to reduce the potential attack surface.",
      "impact": "Disabling CUPS will prevent the system from printing or accepting print jobs.",
      "remediation": "Run the following commands to disable cups: systemctl --now disable cups, apt purge cups",
      "profile": "Level1",
      "type": "ServiceNotInUse",
      "service_names": ["cups"],
      "package_names": ["cups"]
    },
    {
      "id": "2.1.12",
      "title": "Ensure rpcbind services are not in use",
      "section": "Services",
      "description": "The rpcbind service maps RPC services to the ports on which they listen. RPC processes notify rpcbind when they start, registering the ports they are listening on and the RPC program numbers they expect to serve.",
      "rationale": "If the system does not require rpc based services, it is recommended that rpcbind be disabled to reduce the remote attack surface.",
      "impact": "Disabling rpcbind will prevent RPC-based services from functioning.",
      "remediation": "Run the following commands to disable rpcbind: systemctl --now disable rpcbind, apt purge rpcbind",
      "profile": "Level1",
      "type": "ServiceNotInUse",
      "service_names": ["rpcbind"],
      "package_names": ["rpcbind"]
    },
    {
      "id": "2.1.13",
      "title": "Ensure rsync services are not in use",
      "section": "Services",
      "description": "The rsync service can be used to synchronize files between systems over network links.",
      "rationale": "The rsync service presents a security risk as it uses unencrypted protocols for communication.",
      "impact": "Disabling rsync will prevent the system from acting as an rsync server.",
      "remediation": "Run the following commands to disable rsync: systemctl --now disable rsync, apt purge rsync",
      "profile": "Level1",
      "type": "ServiceNotInUse",
      "service_names": ["rsync"],
      "package_names": ["rsync"]
    },
    {
      "id": "2.1.14",
      "title": "Ensure samba file server services are not in use",
      "section": "Services",
      "description": "The Samba daemon allows system administrators to configure their Linux systems to share file systems and directories with Windows desktops.",
      "rationale": "If there is no need to mount directories and file systems to Windows systems, then this service can be disabled to reduce the potential attack surface.",
      "impact": "Disabling Samba will prevent the system from sharing files with Windows systems.",
      "remediation": "Run the following commands to disable samba: systemctl --now disable smbd, apt purge samba",
      "profile": "Level1",
      "type": "ServiceNotInUse",
      "service_names": ["smbd"],
      "package_names": ["samba"]
    },
    {
      "id": "2.1.15",
      "title": "Ensure snmp services are not in use",
      "section": "Services",
      "description": "The Simple Network Management Protocol (SNMP) server is used to listen for SNMP commands from an SNMP management system, execute the commands or collect the information and then send results back to the requesting system.",
      "rationale": "The SNMP server can communicate using SNMP v1, which transmits data in the clear and does not require authentication to execute commands. Unless absolutely necessary, it is recommended that the SNMP service not be used.",
      "impact": "Disabling SNMP will prevent network monitoring via SNMP.",
      "remediation": "Run the following commands to disable snmp: systemctl --now disable snmpd, apt purge snmp",
      "profile": "Level1",
      "type": "ServiceNotInUse",
      "service_names": ["snmpd"],
      "package_names": ["snmp"]
    },
    {
      "id": "2.1.16",
      "title": "Ensure tftp server services are not in use",
      "section": "Services",
      "description": "Trivial File Transfer Protocol (TFTP) is a simple file transfer protocol, typically used to automatically transfer configuration or boot machines from a boot server.",
      "rationale": "TFTP does not support authentication nor does it ensure the confidentiality or integrity of data. It is recommended that TFTP be removed, unless there is a specific need for TFTP. In that case, extreme caution must be used when configuring the services.",
      "impact": "Disabling TFTP will prevent the system from acting as a TFTP server.",
      "remediation": "Run the following commands to disable tftpd-hpa: systemctl --now disable tftpd-hpa, apt purge tftpd-hpa",
      "profile": "Level1",
      "type": "ServiceNotInUse",
      "service_names": ["tftpd-hpa"],
      "package_names": ["tftpd-hpa"]
    },
    {
      "id": "2.1.17",
      "title": "Ensure web proxy server services are not in use",
      "section": "Services",
      "description": "Squid is a standard proxy server used in many distributions and environments.",
      "rationale": "If there is no need for a proxy server, it is recommended that the squid proxy be disabled to reduce the potential attack surface.",
      "impact": "Disabling Squid will prevent the system from acting as a web proxy server.",
      "remediation": "Run the following commands to disable squid: systemctl --now disable squid, apt purge squid",
      "profile": "Level1",
      "type": "ServiceNotInUse",
      "service_names": ["squid"],
      "package_names": ["squid"]
    },
    {
      "id": "2.1.18",
      "title": "Ensure web server services are not in use",
      "section": "Services",
      "description": "HTTP or web servers provide the ability to host web site content.",
      "rationale": "Unless there is a need to run the system as a web server, it is recommended that the service be disabled to reduce the potential attack surface.",
      "impact": "Disabling web server will prevent the system from hosting web content.",
      "remediation": "Run the following commands to disable apache2 and nginx: systemctl --now disable apache2, systemctl --now disable nginx, apt purge apache2 nginx",
      "profile": "Level1",
      "type": "ServiceNotInUse",
      "service_names": ["apache2", "nginx"],
      "package_names": ["apache2", "nginx"]
    },
    {
      "id": "2.1.19",
      "title": "Ensure xinetd services are not in use",
      "section": "Services",
      "description": "The eXtended InterNET Daemon (xinetd) is an open source super daemon that replaced the original inetd daemon.",
      "rationale": "If there are no xinetd services required, it is recommended that the daemon be disabled.",
      "impact": "Disabling xinetd will prevent xinetd-managed services from running.",
      "remediation": "Run the following commands to disable xinetd: systemctl --now disable xinetd, apt purge xinetd",
      "profile": "Level1",
      "type": "ServiceNotInUse",
      "service_names": ["xinetd"],
      "package_names": ["xinetd"]
    },
    {
      "id": "2.1.20",
      "title": "Ensure X window server services are not in use",
      "section": "Services",
      "description": "The X Window System provides a Graphical User Interface (GUI) where users can have multiple windows in which to run programs and various add on.",
      "rationale": "Unless your organization specifically requires graphical login, remove it to reduce the potential attack surface.",
      "impact": "Removing X Windows will prevent graphical programs from running.",
      "remediation": "Run the following command to remove the X Windows System packages: apt purge xserver-xorg*",
      "profile": "Level1",
      "type": "ServiceNotInUse",
      "service_names": [],
      "package_names": ["xserver-xorg-core"]
    },
    {
      "id": "2.1.21",
      "title": "Ensure mail transfer agents are configured for local-only mode",
      "section": "Services",
      "description": "Mail Transfer Agents (MTA), such as sendmail and Postfix, are used to listen for incoming mail and transfer the messages to the appropriate user or mail server.",
      "rationale": "The software for all Mail Transfer Agents is complex and most have a long history of security issues. While it is important to ensure that the system can process local mail messages, it is not necessary to have the MTA's daemon listening on a port unless the server is intended to be a mail server that receives and processes mail from other systems.",
      "impact": "The system will not be able to receive mail from external sources.",
      "remediation": "Edit /etc/postfix/main.cf and add the following line to the RECEIVING MAIL section. If the line already exists, change it to look like the line below: inet_interfaces = loopback-only. Restart postfix: systemctl restart postfix",
      "profile": "Level1",
      "type": "MTALocalOnly",
      "config_file": "/etc/postfix/main.cf",
      "expected_setting": "inet_interfaces = loopback-only"
    },
    {
      "id": "2.1.22",
      "title": "Ensure only approved services are listening on a network interface",
      "section": "Services",
      "description": "Services that are listening on the network present a potential attack surface. Only necessary services should be listening on a network interface.",
      "rationale": "Services listening on the network represent a potential attack surface for an attacker. These services should be reviewed to ensure they are required and any unnecessary services should be removed or disabled to reduce the attack surface of the system.",
      "impact": "The organization will need to determine which services are required for the system to function properly.",
      "remediation": "Run the following command to list services listening on the network: ss -plntu. For each service listed, determine if the service is required. If the service is not required, disable or remove it.",
      "profile": "Level1",
      "type": "Manual"
    }
  ]
}